[
  {
    "Excerpt": "BORJAMOTOR, S.A. received a complaint from a customer who expressed their objection to the company's processing of their personal data for direct marketing purposes via email. Despite this objection, the customer continued to receive emails with offers from the company, at a reduced frequency. BORJAMOTOR, S.A. was found to have used a deceptive pattern known as \"hard to cancel\", which made it difficult for customers to cancel their subscription to the company's marketing emails.",
    "Our analysis": "The hard to cancel deceptive pattern, used by BORJAMOTOR, S.A., made it difficult for the complainant to unsubscribe from their marketing emails. Even after the complainant contacted the company multiple times to stop receiving emails, they still received them. Despite this, the company continued to send emails, although at a reduced frequency. This behaviour is a clear violation of the complainant's right to privacy and control over their personal data, as they had explicitly objected to their data being used for direct marketing purposes. The company's contact form, which was used by the complainant to communicate with the company, was not GDPR-compliant as it did not provide a free and specific consent option. When the complainant used the form, they were forced to accept the privacy policy, which included the processing of their personal data for advertising purposes. This type of consent is not considered free or specific under Article 4(11) of the GDPR, as the data subject did not have a real choice in whether to provide consent or not. As a result, the AEPD found the company to have infringed the LSSI by sending commercial communications without the data subject's proper consent.",
    "Outcome": "Borjamotor, S.A. was fined by the Spanish DPA (AEPD) for violating Article 7 GDPR and Article 21(1) of the Spanish Law on Information Society Services (LSSI). The AEPD enforced a penalty of €4000 for each infringement against the defendant, resulting in a total fine of €8000. However, the defendant opted to take advantage of the reduction for voluntary payment offered by Spanish administrative law and ultimately paid a fine of €4800.",
    "Related deceptive patterns": [
      "Hard to cancel"
    ],
    "Related laws": [
      "GDPR - Article 07",
      "Spanish Law on Information Society Services - Article 21"
    ],
    "title": "A.A.A v. Borjamotor, S.A.",
    "url": "https://www.deceptive.design/cases/a-a-a-v-borjamotor-s-a"
  },
  {
    "Excerpt": "Predase Servicios Integrales SL was fined by the Spanish Data Protection Agency (AEPD) for breaching Article 13 of the GDPR. The company was found to be non-compliant as it did not have a privacy policy and failed to provide any information on data processing in the contact section of its website, which required users to provide their personal data.",
    "Our analysis": "Predase Servicios Integrales SL (PSI) was found to have used a deceptive pattern of hidden information on its webpage. Despite including a section for interested parties to provide their personal information, such as address and telephone number, PSI failed to provide a privacy policy or information on data processing in accordance with Article 13 of the GDPR. PSI attempted to justify this by claiming that the contact form was not operational and that an email address was provided instead. However, the Spanish DPA found errors while attempting to access the website during their investigation, making it impossible to verify this claim. The Spanish DPA held that the lack of a privacy policy or information on data processing, regardless of the non-operational contact form, violated Article 13 GDPR and Article 11 of the Spanish Law on Data Protection and Digital Rights (LOPDGDD) on the provision of information to data subjects.",
    "Outcome": "Predase Servicios Integrales SL was found guilty of violating Article 13 of the GDPR, resulting in a fine of €5000 imposed by the Spanish DPA.",
    "Related deceptive patterns": [
      "Sneaking"
    ],
    "Related laws": [
      "GDPR - Article 13",
      "Spanish Data Protection Law (LOPDGDD) - Article 11"
    ],
    "title": "A.A.A v. Predase Servicios Integrales SL",
    "url": "https://www.deceptive.design/cases/a-a-a-v-predase-servicios-integrales-sl"
  },
  {
    "Excerpt": "The Danish Data Protection Authority issued a ruling against a company which was found to have placed cookies on their website without obtaining valid consent from data subjects. The pop-up cookie banner on the website was designed in a way that made it more difficult for users to reject the use of cookies than to accept them. The company was found to have failed to obtain valid consent from users for the placement of cookies on their devices.",
    "Our analysis": "The Danish DPA investigated a complaint filed by a data subject regarding the controller's use of cookies on their website. The controller relied on consent as a legal basis, but the way they obtained consent violated legal regulations and utilised deceptive patterns of forced action and false hierarchy. The controller's initial consent request was through a pop-up box that only offered the option to “Close” or “Read more about cookies,” with no opt-out solution. This method did not provide data subjects with the option to consent to specific processing purposes, rendering it invalid under Article 6(1)(a) GDPR. In response to the investigation, the controller introduced a new method of requesting consent that included more information about processing and an opt-out solution. However, the DPA found that the design of the cookie banner nudged data subjects towards clicking “ACCEPT ALL” rather than “Accept,” making it easier to consent to cookie use than to reject it. Furthermore, the controller began cookie tracking before obtaining the data subject's consent, which the DPA criticised. Overall, the controller's use of deceptive patterns and failure to follow legal regulations regarding consent and opt-out solutions violated legal guidelines.",
    "Outcome": "The DPA expressed severe criticism about the processing activities based on this cookie banner. Although there was no fine, the company had to implement a new consent solution.",
    "Related deceptive patterns": [
      "Visual interference",
      "Forced action"
    ],
    "Related laws": [
      "GDPR - Article 04(11)",
      "GDPR - Article 06"
    ],
    "title": "Alstrøm - Din Isenkræmmer ApS’s Investigation by Danish Data Protection Authority",
    "url": "https://www.deceptive.design/cases/alstrom-din-isenkraemmer-aps-s-investigation-by-danish-data-protection-authority"
  },
  {
    "Excerpt": "The Danish DPA (Datatilsynet) found that a website's cookie consent mechanism was inadequate, as it only provided an \"Allow all cookies\" option, making continued use of the website equal to consent. The DPA clarified that this approach to marketing cookies was not in compliance with the law.",
    "Our analysis": "The case involves a website that failed to gather valid consent for processing activities related to marketing cookies. The website's cookie consent mechanism only displayed an \"Allow all cookies\" button, and users who wanted to refrain from giving consent had no other option. The website operator interpreted the continued use of the website as consenting to the marketing cookies. However, the Danish DPA (Datatilsynet) held that this was illegal, as consent presupposes voluntariness, which was clearly not present in this case. The DPA also emphasised that consent must be an unequivocal expression of will on the part of the data subject, requiring active action and not merely inactivity. The website visitors were not free to choose in a granular fashion between different processing purposes, such as statistics or marketing, which violated the requirement of granularity. The DPA also referred to Recital 32 GDPR and paragraph 62 of the CJEU Planet49 case (C-673/17), which explicitly state that silence, pre-ticked boxes, or inactivity may not constitute consent. The DPA recommended that the controller reconsider the design of its new consent mechanism, as the current wording was not transparent and easy to understand for website visitors. The text of the consent should only include the processing(s) covered by the consent, and the data controller should be aware of the relevant processing basis for the personal data in the consent text. The new consent mechanism also made it unclear to the website visitor which processing basis(s) actually formed the basis for the website's processing of personal data in relation to statistics and marketing. The DPA encouraged the controller to make the consent mechanism clearer for the website visitor.",
    "Outcome": "The Data Inspectorate (Datatilsynet) has reviewed a new consent solution implemented by a data controller and found the wording used in the consent text to be non-transparent and difficult to understand for website visitors. The consent text should only include the processing covered by the consent, and the data controller should consider the relevant processing basis while designing the consent text. The Datatilsynet also notes that the new consent solution allows website visitors to object to the website's legitimate interests in relation to statistics and marketing by clicking on \"cookie settings.\" However, this setup makes it unclear to the website visitor which processing basis(s) actually form the basis for the website's processing of personal data in relation to statistics and marketing. Therefore, the DPA encourages the controller to reconsider the design of its new consent mechanism.",
    "Related deceptive patterns": [
      "Forced action"
    ],
    "Related laws": [
      "GDPR - Article 04(11)",
      "GDPR - Article 06"
    ],
    "title": "Anonymous (complainant) v. DGU Erhverv A / S",
    "url": "https://www.deceptive.design/cases/anonymous-complainant-v-dgu-erhverv-a-s"
  },
  {
    "Excerpt": "The Belgian DPA fined the private company targeting pregnant mothers. The company through its marketing campaign collected personal data without informing clearly of the processing. Despite withdrawing consent, the complainant was contacted by third parties for its promotions wherein it technically made it difficult to withdraw consent and stop receiving unwanted phone calls from the defendant's partners.",
    "Our analysis": "The defendant is a marketing company that distributes pink boxes which target pregnant mothers that include samples, special offers and information sheets for future parents. This personal data was then transferred by the defendant to third parties in exchange for the aforementioned offers and samples. But the defendant failed to provide the complainant with clear and transparent information about the processing of her personal data, including the transfer of data to third parties. Additionally, the complainant was able to easily enter into an agreement with the defendant by filling out a registration form and receiving a pink box, but found it difficult to withdraw her consent and stop receiving unwanted phone calls from the defendant's partners. The case deals with a classic example of hard to cancel where it is harder to opt out from the commercials, as when The complainant subsequently decided to withdraw her consent, even after having exercised her right, the complainant still received unwanted phone calls from partners of the defendant in connection with certain promotions. The defendant had breached Article 5 of the GDPR as well as article 13 due to the lack of transparency as the defendant was renting and/or selling personal data for commercial purposes via its partners without informing the consumers about these processings in a clear and comprehensible manner. The defendant also violated Article 6 of the GDPR, as there could not have been a free, explicit, informed, and unambiguous permission granted by the customers as there was in this case: a) Clearly not informed; b) - not specific (because accepting the boxes required consent for the transfer of data); c) - not given voluntarily (as the lack of consent involved the loss of some benefits).",
    "Outcome": "The company was fined €50,000 by the Belgian DPA. The severity of the breach, the nature of the data collected (including information about children), and the large number of individuals affected (21.10% of the Belgian population) were all taken into consideration by the Litigation Chamber of the BE DPA when imposing the fine. Additionally, the company has been ordered to comply with the GDPR within six months.",
    "Related deceptive patterns": [
      "Hard to cancel",
      "Sneaking"
    ],
    "Related laws": [
      "GDPR - Article 05",
      "GDPR - Article 06",
      "GDPR - Article 07"
    ],
    "title": "Anonymous (Complainant) v. National Service for the Promotion of Childcare Products",
    "url": "https://www.deceptive.design/cases/anonymous-complainant-v-national-service-for-the-promotion-of-childcare-products"
  },
  {
    "Excerpt": "The Spanish DPA (AEPD) fined ASOCAPAC for insufficient information provided on the first layer of the cookie banner and the missing \"refuse all cookies\" option in the cookie policy on their website.",
    "Our analysis": "In the case of FACUA vs ASOCAPAC, FACUA filed a complaint against ASOCAPAC for their cookie banner on their website. The Spanish DPA (AEPD) conducted an investigation and found that the cookie banner did not provide clear and concise information, as it only stated that \"This website uses its own and third party cookies to offer you a better experience and service.\" This lack of information undermines the transparency of the message. Furthermore, the Spanish DPA discovered that the cookie policy on ASOCAPAC's website did not provide information on the identification and the time that the cookies were active, although it did provide additional information on what cookies are and what first and third-party cookies are used for. The DPA also noted that there was no option to refuse all cookies. The Spanish DPA (AEPD) found that the lack of sufficient information on the first layer of the cookie banner, the absence of information about the type of cookie and the duration of their activity, as well as the lack of a \"refuse all cookie\" option, constituted a breach of Article 22(2) of the Spanish Law on Services of the Information Society and Electronic Commerce (LSSI). Therefore, the DPA imposed a warning sanction on ASOCAPAC and gave them one month to modify the cookie banner and introduce a new cookie policy.",
    "Outcome": "The AEPD found that ASOCAPAC violated Article 22(2) of the Spanish LSSI due to the insufficient information on their cookie banner, lack of information on cookie type and time of activity, and the absence of a “refuse all cookies” option. As a consequence, ASOCAPAC received a warning sanction from the AEPD and was given one month to modify their cookie banner and implement a new cookie policy.",
    "Related deceptive patterns": [
      "Forced action",
      "Sneaking"
    ],
    "Related laws": [
      "Spanish Law on Information Society Services - Article 22"
    ],
    "title": "Asociación de Consumidores y Usuarios en Acción (FACUA) v. Asociación de Afectados por las Asociaciones de Consumidores (ASOCAPAC)",
    "url": "https://www.deceptive.design/cases/asociacion-de-consumidores-y-usuarios-en-accion-facua-v-asociacion-de-afectados-por-las-asociaciones-de-consumidores-asocapac"
  },
  {
    "Excerpt": "Orange România SA was found responsible for using pre-ticked boxes as a form of obtaining consent from customers for storing copies of their identity documents, which does not constitute active consent.",
    "Our analysis": "Orange România SA, a provider of mobile telecommunications services in Romania, was found to have violated Article 32 of the Romanian Data Protection Act by obtaining and storing copies of customers' identity documents without their express consent. The Autoritatea Naţională de Supraveghere a Prelucrării Datelor cu Caracter Personal (national Romanian data protection authority) imposed an administrative penalty on Orange România and ordered the controller to destroy already existing copies of the IDs.Orange România had requested consent for this data processing by providing customers with the option to refuse their consent in handwritten form. However, some of the contracts for mobile telecommunication services had a pre-ticked box signaling the consent to the storage of ID copies, while others did not. In order to refuse consent, customers had to fill out an additional form before the conclusion of the contract.The DPA found that the use of pre-ticked boxes to signal consent to the storage of ID copies was a deceptive pattern that violated the principle of \"freely given\" consent. The DPA argued that \"freely given consent\" requires active behavior and a high degree of autonomy on the part of the data subject. Consent in the form of a preselected tick of a checkbox cannot imply active consent on the part of the data subject dealing with a physical document which he or she ultimately signs. The DPA also found that Orange România failed to ensure that the customers were sufficiently informed about the data processing, violating the principle of \"informed consent\".",
    "Outcome": "In response to the preliminary ruling concerns the interpretation of Article 2(h) of Directive 95/46/EC, CJEU held that Article 2(h) and Article 7(a) of Directive 95/46/EC and Article 4(11) and Article 6(1)(a) of Regulation (EU) 2016/679 state that data controllers must prove that data subjects have given active and informed consent for their personal data to be processed. A telecommunications contract containing a clause stating that a data subject has given consent to the collection and storage of their identity document for identification purposes does not demonstrate valid consent if the box has been pre-ticked, the contract is misleading, or the data subject is required to complete an additional form to refuse consent.",
    "Related deceptive patterns": [
      "Preselection"
    ],
    "Related laws": [
      "GDPR - Article 04(11)",
      "GDPR - Article 06",
      "GDPR - Article 07",
      "Romanian Data Protection Act (Law No 677/2001) - Article 32",
      "Directive 95/46 - Article 2(h)",
      "Directive 95/46 - Article 6",
      "Directive 95/46 - Article 7"
    ],
    "title": "Autoritatea Naţională de Supraveghere a Prelucrării Datelor cu Caracter Personal v. Orange  România SA",
    "url": "https://www.deceptive.design/cases/autoritatea-nationala-de-supraveghere-a-prelucrarii-datelor-cu-caracter-personal-v-orange-romania-sa"
  },
  {
    "Excerpt": "The Belgian DPA issues a reprimand to a government agency for failing to provide website visitors with clear information and a means to refuse non-strictly necessary cookies.",
    "Our analysis": "The Inspection Service of the Belgian DPA initiated an investigation into a regional government agency for tourism, which collects personal data of Airbnb hosts through Airbnb as an intermediary. The controller's legal task of monitoring the quality of Airbnb hosts forms the legal basis for the collection of personal data. However, the Inspection Service found that the controller's interpretation of its legal obligations was too broad and that its privacy policy contained wrong and missing information, violating Article 12(1), Article 13, and Article 14 GDPR. The controller admits to having previously had issues with its privacy policy but has since resolved them. Additionally, the Inspection Service found that the website had non-strictly necessary cookies and lacked clear information on how to refuse them. The DPA confirms the violations of the privacy policy and the cookie policy but dismisses the report on non-strictly necessary cookies. The DPA also determines that the controller did not proactively involve the DPO, resulting in a breach of Article 38(1) and Article 39(1) GDPR. However, the DPA concludes that the controller can rely on legal obligation under Article 6(1)(c) GDPR to process the personal data of Airbnb hosts as the purpose is clear, necessary, and proportional.",
    "Outcome": "The DPA issued a reprimand to the controller for past breaches of GDPR, but dismissed any parts that did not constitute GDPR infractions. The DPA also clarified that it did not have the authority to impose a fine on a governmental agency.",
    "Related deceptive patterns": [
      "Trick wording",
      "Forced action"
    ],
    "Related laws": [
      "GDPR - Article 04(11)",
      "GDPR - Article 05",
      "GDPR - Article 06",
      "GDPR - Article 07",
      "GDPR - Article 24",
      "GDPR - Article 25"
    ],
    "title": "Belgian DPA's Investigation against Toerisme Vlaanderen",
    "url": "https://www.deceptive.design/cases/belgian-dpa-s-investigation-against-toerisme-vlaanderen"
  },
  {
    "Excerpt": "The Austrian DPA found the respondent at fault for not providing information and notifications in languages that are relevant to the countries where the services are being offered, based on the nationality or place of residence of the data subject.",
    "Our analysis": "The respondent violated Article 14 of GDPR by using a deceptive pattern of language discontinuity, as they provided the complainant with information in Polish, despite the complainant residing in Austria and speaking German. The respondent further processed the complainant's data for five months without informing her. Although the respondent subsequently provided the required information in German during the proceedings, they violated the law by not initially providing information in a language that the complainant could understand. However, the complaint was dismissed as the complainant did not claim linguistic inability and the subsequent information was considered to be sufficiently comprehensible.",
    "Outcome": "The Austrian DPA stated that the respondent can fix the alleged violation by following the complainant's requests until the investigation is finished.",
    "Related deceptive patterns": [
      "Trick wording"
    ],
    "Related laws": [
      "GDPR - Article 03",
      "GDPR - Article 04(16)",
      "GDPR - Article 12",
      "GDPR - Article 14",
      "GDPR - Article 15",
      "GDPR - Article 57",
      "Austria Data Protection Act (DSG) - Section 24 (6)",
      "Federal Constitution (Austria) - Article 8"
    ],
    "title": "Brigitte A. v. N & Co Material GmbH",
    "url": "https://www.deceptive.design/cases/brigitte-a-v-n-co-material-gmbh"
  },
  {
    "Excerpt": "Google faced liability for processing user data across services without affording users adequate choice options through its selection dialogue interfaces.",
    "Our analysis": "- Google from utilizing data processing terms that allowed the processing of user data across services without providing users with sufficient choice options.- The key violation pertains to Google conditioning the use of its services on users' agreement to data processing terms, thereby restricting their ability to negotiate or exercise sufficient choices. Google's unilateral imposition of data processing terms, coupled with a lack of granularity in setting options, led to a scenario where users faced a \"take it or leave it\" situation. Users were compelled to accept cross-service data processing without the ability to opt out or tailor the processing to specific services, violating the requirement for freely given and informed consent.-The absence of clear indications and comprehensive information on how data are processed across services, coupled with imprecise terminology, contributed to users' inability to make informed decisions.- The ruling emphasized the inadequacy of Google's approach, highlighting the absence of equivalence between consent and rejection during account creation, particularly in the context of \"Express personalization,\" where users were effectively steered towards accepting data processing options.",
    "Outcome": "The Bundeskartellamt ruled that Google must enable users to provide free, specific, informed, and unambiguous consent for cross-service data processing. Google is required to offer transparent choice options for data combinations, ensuring that selection dialogues are not manipulative and avoiding the use of dark patterns.",
    "Related deceptive patterns": [
      "Forced action",
      "Preselection"
    ],
    "Related laws": [
      "German Competition Act - Section 19a(2)"
    ],
    "title": "Bundeskartellamt's Administrative Proceeding against Google",
    "url": "https://www.deceptive.design/cases/bundeskartellamt-s-administrative-proceeding-against-google"
  },
  {
    "Excerpt": "Carrefour France has been fined by CNIL for violating GDPR and French data protection laws, including excessive data retention, unclear data processes, inadequate response to requests, security breaches, and unlawful use of cookies. They also sent prospecting emails despite objections and did not provide unsubscribe links.",
    "Our analysis": "In 2019, the French Data Protection Authority (CNIL) investigated the online retail store carrefour.fr, operated by Carrefour France, after receiving fifteen complaints related to the website between June 2018 and April 2019. The CNIL found several violations of the General Data Protection Regulation (GDPR), the French Data Protection Act (Loi Informatique & Libertés), and the French postal and electronic communications code, including the use of deceptive patterns. Some of the violations included Carrefour sending prospecting emails to data subjects who had objected, not providing a positive response to data deletion and access requests, not including an unsubscribe link in commercial emails, keeping data on loyalty program members for four years after their last contact with the company, keeping a copy of a data subject's ID card after their request was met, and systematically requesting an ID card for the exercise of a right by a data subject, violating Article 12 GDPR. The CNIL also investigated the information provided to data subjects, including the spread of mandatory information on data processing across several web pages, making the information part of the terms and conditions of the loyalty program, and referring data subjects to the privacy policy on the carrefour.fr website without specifying the exact URL address. The use of vague wording was also a violation, such as \"These treatments mainly include\" and \"for one or more of the following purposes for which your data may be used.\"The CNIL reminded Carrefour France that the appropriate data retention period should be determined based on the purpose of the processing and the specifics of the business sector of the data controller. For loyalty program members of a retail company, the CNIL recommends a maximum retention period of three years. The CNIL found that Carrefour violated Article 5(1)(e) GDPR by keeping a copy of a data subject's ID card for up to six years when dealing with data subjects' exercise of rights. The systematic request for an ID in order to exercise a right was also a violation, making the exercise of right harder than it should be, and Carrefour exceeded regularly the one-month delay to answer a request. Regarding the right to information, the CNIL found that the information provided to data subjects was not easily accessible and not clear, concise, and transparent as required by Articles 12 and 13 GDPR. The information was spread-out across several web pages and not organised nor prioritised, and several mandatory information were missing or incorrect.",
    "Outcome": "In a joint effort with CNIL, Carrefour France has been sanctioned for the use of unprotected URL addresses that led to the public exposure of personal data. The violation of Article 32 GDPR resulted in a €800000 fine on Carrefour Banque, a sibling company of Carrefour France.",
    "Related deceptive patterns": [
      "Hard to cancel",
      "Sneaking"
    ],
    "Related laws": [
      "GDPR - Article 05",
      "GDPR - Article 12",
      "GDPR - Article 13",
      "GDPR - Article 14",
      "GDPR - Article 15",
      "GDPR - Article 17",
      "GDPR - Article 21",
      "GDPR - Article 32",
      "GDPR - Article 33",
      "GDPR - Article 83"
    ],
    "title": "Carrefour France Investigation by CNIL",
    "url": "https://www.deceptive.design/cases/carrefour-france-investigation-by-cnil"
  },
  {
    "Excerpt": "CMA held Microsoft liable for unclear upfront terms, difficulty in turning off auto-renewal, and customers unknowingly paying for unused services in their auto-renewing Xbox Live Gold and Game Pass memberships.",
    "Our analysis": "Microsoft's Xbox Live Gold and Game Pass provide a platform for gamers to access a vast library of games and play with each other online. These products operate on a membership basis, with automatic renewal at the end of each contract period, requiring customers to actively take steps to cancel their subscription. The Competition and Markets Authority (CMA) has launched an investigation into the auto-renewal terms of Nintendo Switch, PlayStation, and Xbox to determine if they are unfair. During its investigation, the CMA identified concerns regarding Microsoft's auto-renewing subscriptions, including unclear upfront contract renewal terms, difficulty in turning off automatic renewal, and customers continuing to pay for services they no longer use. Microsoft has made commitments to address these concerns in the CMA's efforts to investigate the online console video gaming sector.",
    "Outcome": "Microsoft has made significant improvements to its Xbox memberships following an investigation by the Competition and Markets Authority (CMA). The changes include better upfront information about auto-renewal terms, refunds for accidental renewals, reminders for inactive memberships, and clearer notifications of any future price increases.",
    "Related deceptive patterns": [
      "Hidden subscription",
      "Hard to cancel"
    ],
    "Related laws": [
      "Consumer Protection from Unfair Trading Regulations, 2008",
      "Consumer Rights Act, 2015",
      "Consumer Contracts (Information Cancellation and Additional Charges) Regulations, 2013"
    ],
    "title": "CMA's Investigation against Nintendo Switch, PlayStation and Xbox",
    "url": "https://www.deceptive.design/cases/cma-s-investigation-against-nintendo-switch-playstation-and-xbox"
  },
  {
    "Excerpt": "UK DPA fined a car finance company for not providing a simple, clear and specific opt-out process for marketing, lack of information about data processing practices, and absence of opt-out option for individuals.",
    "Our analysis": "CCSL, a car finance company in the UK, was fined by the Information Commissioner's Office (ICO) for violating Regulation 22 of PECR by sending unsolicited direct marketing messages. Between 2018 and 2019, the ICO received nearly 200 complaints regarding the unsolicited electronic direct marketing text messages sent by CCSL. The ICO found that individuals did not have the option other than agreeing to receive direct marketing, making consent not freely given. Similarly, it was not specific as individuals could not select which party they agreed to receive marketing from, and it was not informed as the information provided was too vague. The company used a hard opt-out process, making it difficult for individuals to opt-out of receiving marketing messages. CCSL claimed to have gathered consent through an application form with no specific reference to direct marketing or purposes of contact from third parties, and there was no method for the individual to apply without consenting to being contacted. The company also failed to provide individuals with the opportunity to refuse or opt-out in the first place.",
    "Outcome": "CCSL was fined approximately €198,000 by the ICO, which considered several factors in determining the amount of the fine. These factors included the gravity of the violation, as well as whether the violation was committed intentionally or negligently, and the extent to which CCSL cooperated with the investigation.",
    "Related deceptive patterns": [
      "Hard to cancel",
      "Forced action",
      "Sneaking"
    ],
    "Related laws": [
      "GDPR - Article 04(11)",
      "Privacy and Electronic Communications (EC Directive) Regulation 2003 - Regulation 22",
      "Privacy and Electronic Communications (EC Directive) Regulation 2003 - Regulation 2(1)"
    ],
    "title": "Colour Car Sales Limited's Investigation by UK DPA",
    "url": "https://www.deceptive.design/cases/colour-car-sales-limited-s-investigation-by-uk-dpa"
  },
  {
    "Excerpt": "Emma Matratzen GmbH is being accused for misleading consumers by creating an impression that their sale was time-limited with a countdown clock, despite starting another sale for new customers immediately after the \"flash sale\" ended.",
    "Our analysis": "The case involves a complaint against Emma Matratzen GmbH for creating  impression that the sale was time-limited. The ad featured a countdown clock suggesting a \"flash sale\" and \"up to 50% off\" their products for a limited time period, but it was found that another sale for new customers started immediately after the \"flash sale\" ended, making the offer not actually time-limited. The use of the countdown clock was likely to pressurize consumers into making a hasty purchase decision, so the ASA ruled that the ad was misleading and must not appear again in its current form.",
    "Outcome": "The CMA has initiated an investigation into the Emma Group and will be working with them to gather evidence. The purpose of this investigation is to determine whether any of the companies within the group have violated consumer protection laws.",
    "Related deceptive patterns": [
      "Fake urgency"
    ],
    "Related laws": [
      "UK Code of Non-broadcast Advertising, Sales Promotion and Direct Marketing"
    ],
    "title": "Competition and Markets Authority v. Emma Sleep GmbH",
    "url": "https://www.deceptive.design/cases/competition-and-markets-authority-v-emma-sleep-gmbh"
  },
  {
    "Excerpt": "TransUnion deceived consumers by falsely marketing credit scores and credit-related products, enrolling consumers without consent, lacking cancellation mechanisms, and providing misleading information about the products' costs, purpose, and protection of personal information.",
    "Our analysis": "TransUnion engaged in deceptive practices by manipulating consumers to sign up for subscription services, violating the Consumer Financial Protection Act (CFPA). They enrolled consumers without consent, failed to offer cancellation mechanisms, misrepresented products as free or $1, falsely portrayed the purpose of collecting payment information, provided misleading information about their credit score, and misrepresented the consequences of product cancellation. Transunion manipulated its consumers to sign up for the subscription services. The follow up examination revealed that the defendant violated the settlement agreed and while it required credit card information for verification purposes, it contained a button for availing a free credit score which if clicked would result in the user being signed up for a recurring monthly subscription. These disclosures were mentioned in fine print and were difficult to locate. Additionally, they violated the Electronic Fund Transfer Act (EFTA) and Regulation E by not obtaining written authorization for recurring charges and failing to provide copies of such authorizations to consumers.",
    "Outcome": "CFPB settled charges with TransUnion, requiring the company to pay $13.9 million in restitution and $3 million in civil penalties. TransUnion was also bound by a law enforcement order to warn consumers about the limited use of credit scores, obtain consent for recurring payments, provide easy cancellation options, and comply with other requirements. Despite initial violations in 2019, TransUnion continued to violate the order and engage in further legal violations, leading to further consequences from the CFPB.",
    "Related deceptive patterns": [
      "Hard to cancel",
      "Forced action",
      "Hidden subscription"
    ],
    "Related laws": [
      "Consumer Financial Protection Act",
      "Electronic Fund Transfer Act (EFTA)"
    ],
    "title": "Consumer Financial Protection Bureau v. Transunion",
    "url": "https://www.deceptive.design/cases/consumer-financial-protection-bureau-v-transunion"
  },
  {
    "Excerpt": "Czech DPA fined a broadcaster as the information it provided was not provided in an easily accessible manner, incomplete and outdated.",
    "Our analysis": "During the inspection, the DPA (Data Protection Authority) verified the compliance of a television broadcaster, who was a controller, with regards to the use of cookies on its multimedia websites under the GDPR (General Data Protection Regulation). The controller had informed its users about the use of cookies for setting usernames, language, and analytics purposes, but failed to update its privacy policy in an easily accessible manner and with complete and updated information. The controller had also taken technical and organizational measures to secure the data of its users, which had been regularly updated and documented in the privacy policy. However, the DPA found a violation of Article 12(1) and Article 12(2) GDPR due to incomplete and outdated information in the privacy policy and failure to notify users about its update. The controller rectified the violation during the inspection, but a fine was still imposed.",
    "Outcome": "During the inspection, it was found that the controller had violated Article 12(1) GDPR and Article 12(2) GDPR, which required them to provide clear and comprehensive information to data subjects about the processing of their personal data. As a result, the controller was fined. However, it was also found that the controller had failed to cooperate with the inspection, which resulted in a separate fine of CZK 100,000 (approx. €3800) being imposed. The illegal condition was rectified during the inspection, but the lack of cooperation was still considered a serious breach.",
    "Related deceptive patterns": [
      "Sneaking",
      "Trick wording"
    ],
    "Related laws": [
      "GDPR - Article 12"
    ],
    "title": "Czech DPA's Investigation into Anonymous Television Broadcaster",
    "url": "https://www.deceptive.design/cases/czech-dpa-s-investigation-into-anonymous-television-broadcaster"
  },
  {
    "Excerpt": "The Spanish DPA (AEPD) fined Asociación de Víctimas por Arbitrariedades Judiciales (JAVA) for publishing illegal recordings on its website and dropping Google Analytics cookies without user consent. Additionally, there was no second layer on the cookie banner enabling the user to refuse to consent to all cookies.",
    "Our analysis": "The complainants raised concerns that illegal recordings of witness statements were being used on the website of Asociación de Víctimas por Arbitrariedades Judiciales (JAVA). These recordings were obtained by a lawyer in a corruption case, and the complainants argued that the publication of these recordings on the website was an infringement of Article 6(1)(a) of the General Data Protection Regulation (GDPR), which states that personal data shall be processed lawfully, fairly, and in a transparent manner. Moreover, the Spanish Data Protection Agency (DPA) found that upon accessing JAVA's website, several Google Analytics cookies were dropped without the user's consent. The DPA also noted that the cookie banner displayed on the website lacked clarity and did not provide the user with an option to refuse all cookies. These actions were considered to be a violation of Article 22(2) of the Spanish national law on the Information Society and eCommerce (LSSI). The issue of concern in this case is whether publishing illegal recordings on a website constitutes an infringement of Article 6(1)(a) GDPR. The answer is yes, as the GDPR prohibits the processing of personal data obtained unlawfully. In this case, the recordings were obtained illegally, and therefore, publishing them on the website without the consent of the individuals recorded was a violation of the GDPR. Additionally, the placing of cookies without user consent and the lack of a \"Refuse all\" option on the cookie banner are violations of Article 22(2) LSSI. The lack of clarity in the cookie banner message further emphasises the use of deceptive patterns, forcing the user to take action, as users would assume that by continuing to use the website, they are giving their consent to the use of cookies.",
    "Outcome": "JAVA was fined €8000 by the Spanish DPA (AEPD) for violating Article 6(1)(a) and Article 22(2) of the Spanish national law on the Information Society and eCommerce (LSSI) related to their use of illegal recordings and unclear and insufficient cookie policy. The DPA found that the wording of the cookie banner lacked clarity and that Google Analytics cookies were being placed without user consent. Moreover, the absence of a \"Refuse all\" button in the cookie banner was also deemed a violation of LSSI. The fine of €5000 was imposed for publishing recordings obtained illegally, while an additional fine of €3000 was imposed for the violations related to the cookie policy.",
    "Related deceptive patterns": [
      "Forced action"
    ],
    "Related laws": [
      "GDPR - Article 06",
      "Spanish Law on Information Society Services - Article 22"
    ],
    "title": "D.A.A.A., and D. B.B.B. (Claimants) v. Asociación de Víctimas por Arbitrariedades Judiciales (JAVA)",
    "url": "https://www.deceptive.design/cases/d-a-a-a-and-d-b-b-b-claimants-v-asociacion-de-victimas-por-arbitrariedades-judiciales-java"
  },
  {
    "Excerpt": "Iweb Internet Learning, S.L. was fined by the Spanish Data Protection Agency for failing to identify the data controller, not allowing separate consent for each purpose, and providing insufficient information on the use of cookies.",
    "Our analysis": "The AEPD initiated a sanction procedure against the defendant after receiving a complaint from Neptunos Formación, S.L., which highlighted the absence of any information on the identity of the defendant on their website. The AEPD investigated whether the defendant had complied with the applicable laws, specifically whether the privacy policy provided information on the data controller and whether the website offered a choice for users to provide specific and separate consent for each purpose. However, this information was not readily available on the website. Furthermore, the website did not include any banner or information on the use of cookies. The AEPD found the defendant in potential violation of Article 13 GDPR, Article 7 GDPR, and Article 22(2) LSSI due to their bundling of information and hidden presentation of key details.",
    "Outcome": "The AEPD found that the defendant had violated Article 13 GDPR, Article 7 GDPR, and Article 22(2) LSSI by not identifying the data controller, not providing a separate consent option for each purpose, and not providing sufficient information on the use of cookies. The AEPD determined that, due to aggravating circumstances such as the defendant's intentionality and the length of time the violations occurred, a fine of €13,000 would be imposed if the sanction procedure was successful. However, the AEPD offered the defendant the opportunity to settle the matter by voluntarily paying part of the fine and acknowledging its liability before a final decision was made. The defendant agreed, and the AEPD closed the sanction procedure.",
    "Related deceptive patterns": [
      "Sneaking",
      "Forced action"
    ],
    "Related laws": [
      "GDPR - Article 07",
      "GDPR - Article 13",
      "Spanish Law on Information Society Services - Article 22"
    ],
    "title": "D.A.A.A (Claimant) on behalf of Neptunos Formación, S.L. v. Iweb Internet Learning, S.L.",
    "url": "https://www.deceptive.design/cases/d-a-a-a-claimant-on-behalf-of-neptunos-formacion-s-l-v-iweb-internet-learning-s-l"
  },
  {
    "Excerpt": "Add Event Staff, S.L. was warned by the Spanish DPA (AEPD) for not obtaining separate consent for processing activities related to job search and commercial purposes.",
    "Our analysis": "Add Event Staff, S.L., a Spanish event organizing company, was recently warned by the Spanish DPA (AEPD) for violating GDPR and the Spanish Law on Data Protection and Digital Rights Guarantee (LOPDGDD). The decision was made in response to a complaint from a Spanish citizen who had registered for a job fair organized by Add Event Staff, S.L. The citizen stated that the web form required him to give consent not only for participation in the job fair, but also for receiving commercial communications and transferring his data to third parties. When he requested that his consent be used only for participation in the job fair, the defendant refused, stating that the claimant was obligated to receive commercial communications as it was a free event.Add Event Staff, S.L. claimed that the processing activities were based on the claimant's consent and that he was fully informed about the need to process his data for participation in the job fair, as well as the possibility of receiving commercial communication, which could be unsubscribed from. However, the AEPD initiated a sanction procedure, and the defendant responded by stating that the participation in the event had one single purpose, which was to communicate attendees with the companies for networking objectives, and that the company was in the process of changing its forms to adopt the corresponding measures. The AEPD found that Add Event Staff, S.L. had violated Article 7 of GDPR and Article 6(3) of LOPDGDD by bundling different processing activities and requiring consent for them collectively, rather than obtaining separate consent for each specific activity. The defendant's actions deceived the claimant and violated their right to freely give or withhold consent for each processing activity.",
    "Outcome": "The AEPD found that Add Event Staff, S.L. violated Article 7 of the GDPR and Article 6(3) of the Spanish Law on Data Protection and Digital Rights Guarantee (LOPDGDD) by not obtaining separate consents for different processing activities related to job search and commercial purposes. The AEPD emphasized that commercial communications and attendance to a job fair are different purposes and therefore require separate consents. The AEPD also noted that the execution of an agreement cannot be made conditional on the data subject consenting to processing activities not strictly related to the contract relationship. As a result, the AEPD imposed a warning on the defendant and required them to correct the situation within one month of the resolution.",
    "Related deceptive patterns": [
      "Forced action"
    ],
    "Related laws": [
      "GDPR - Article 07",
      "Spanish Data Protection Law (LOPDGDD) - Article 6"
    ],
    "title": "D.A.A.A (Claimant) v. Add Event Staff, S.L",
    "url": "https://www.deceptive.design/cases/d-a-a-a-claimant-v-add-event-staff-s-l"
  },
  {
    "Excerpt": "The Spanish Data Protection Authority (AEPD) initiated a sanction procedure against Eslora Proyectos, S.L. based on a complaint filed by a Spanish citizen, which alleged that the defendant, the owner of three websites, failed to provide the necessary basic layer information to users regarding the cookies loaded on the websites.",
    "Our analysis": "The case analysis involves a sanction procedure initiated by the Spanish Data Protection Authority (AEPD) against Eslora Proyectos, S.L. for failing to provide the necessary basic layer information to users regarding cookies loaded on their three websites. The defendant's response to the AEPD investigation requests included claims that they were performing data protection adaptation to GDPR, and they had limited resources. They also argued that due to a controversial CJEU judgement, they decided not to install a basic layer regarding cookies until the publication of any guides or recommendations by the AEPD. However, the AEPD found that the three websites loaded non-necessary cookies, including Facebook ones, without informing or obtaining user consent, and the basic layer was too vague and did not follow AEPD recommendations. Additionally, the second layer of the websites provided generic information on cookies but not specific information on which cookies would be installed or how long they would be installed. The AEPD understood that the defendant could have breached its information duties in relation to cookies under Article 22(2) of the LSSI. The defendant accepted the AEPD's cookie guide and installed the basic information layer, but it was still not compliant with the legislation. The AEPD offered the defendant the option to settle the issue before the decision takes place by agreeing to a voluntary payment of part of the fine with two possible discounts.",
    "Outcome": "The defendant in a sanction procedure was given the opportunity by the AEPD to settle the issue before the decision was made by agreeing to a voluntary payment of part of the fine with two possible discounts. The defendant agreed to both concepts, acknowledged their liability, and made an early voluntary payment of 6,000 €. As a result, the sanction procedure was closed by the AEPD.",
    "Related deceptive patterns": [
      "Forced action",
      "Sneaking"
    ],
    "Related laws": [
      "GDPR - Article 07",
      "GDPR - Article 13",
      "Spanish Law on Information Society Services - Article 22"
    ],
    "title": "D.A.A.A (Claimant) v. Eslora Proyectos, S.L.",
    "url": "https://www.deceptive.design/cases/d-a-a-a-claimant-v-eslora-proyectos-s-l"
  },
  {
    "Excerpt": "A controller was fined by the AEPD for inadequate cookie information on its website, including a lack of information on tracking cookies and a vague cookie policy without an easy uninstall tool.",
    "Our analysis": "The case involves a complaint of non-compliance regarding the processing of personal data and the use of cookies on a company's website. The complainant alleged that employees could access all types of personal data, regardless of their tasks, without using login credentials or passwords. The complainant also claimed that the company's website did not provide adequate information regarding the use of cookies. The first pop-up banner did not inform users about the existence of tracking cookies, and the full cookie policy was vague and did not provide an easy way to uninstall cookies. The Spanish data protection authority (AEPD) was tasked with investigating the complaint and assessing whether the processing was safeguarded with appropriate technical and organisational measures. The AEPD also had to verify whether the controller had respected the Spanish implementation of the ePrivacy Directive and had provided clear and complete information on the use of cookies. After a thorough investigation, the AEPD found that some of the complainant's statements were not accurate. The company had improved its security measures by limiting employees' access to personal data and resources required to carry out their tasks. Printed manuals and personal data were stored in locked filing cabinets, and access to the office was only allowed to authorised personnel. However, the AEPD did find that the company's website was not compliant with Article 22(2) of the Spanish ePrivacy Directive. The first layer of the pop-up notification did not provide sufficient information for users to understand the use of cookies. Phrases like \"improve our services\" were not descriptive enough to inform users about the types of cookies used. The second layer of the cookie policy did not describe the types of cookies used or provide information about their sources (first or third-party). Additionally, there was no tool to manage cookies in a granular way. As a result of these findings, the AEPD determined that the company had violated Article 22(2) of the Spanish ePrivacy Directive and imposed appropriate sanctions.",
    "Outcome": "Following an investigation into a complaint of general non-compliance regarding processing, the AEPD found that some statements were no longer accurate in terms of appropriate technical and organisational measures. However, they found a violation of Article 22(2) of the LSSI with regards to the Cookie Policy. As a result, the case was partly upheld, and a fine of €1500 was imposed on the controller.",
    "Related deceptive patterns": [
      "Forced action",
      "Sneaking"
    ],
    "Related laws": [
      "GDPR - Article 05",
      "GDPR - Article 32",
      "Spanish Law on Information Society Services - Article 22"
    ],
    "title": "D.A.A.A. (Claimant) v. Happy Friday, SL",
    "url": "https://www.deceptive.design/cases/d-a-a-a-claimant-v-happy-friday-sl"
  },
  {
    "Excerpt": "The Spanish DPA fined a hospital for obtaining consent through pre-ticked boxes for commercial communication and data processing and failure to timely provide a copy of the form.",
    "Our analysis": "The hospital, acting as the controller of the data subject's personal information, utilized a deceptive pattern by preselecting two consent boxes in the privacy notice without the data subject's knowledge or consent. The first box referred to commercial communications, and the second one referred to the consent to disclose personal data regarding the data subject's stay at the hospital and room number with third parties upon request. The hospital claimed that the pre-ticked box was a human error and that the clause about communication of patients' personal data to third parties did not apply to the data subject. However, the DPA found that the hospital violated Articles 6(1) and 15 in connection with Article 12 GDPR by unlawfully processing data for third-party sharing and commercial purposes and failing to process the data subject's access request in a timely manner. The DPA further observed that the use of pre-ticked boxes rendered consent invalid, resulting in a lack of legal basis under Article 6(1) GDPR. The hospital's action violated Article 7 GDPR and Recital 32 GDPR, which require that the consent request meet specific requirements.",
    "Outcome": "The DPA had initially imposed a fine of €10,000 each for the violation of Articles 6(1) and 15 in connection with Article 12 GDPR. However, the final fine amount was reduced to €16,000 as the controller benefited from two reductions. One reduction was granted for accepting guilt, and the other was given for voluntarily paying the fine.",
    "Related deceptive patterns": [
      "Preselection"
    ],
    "Related laws": [
      "GDPR - Article 06",
      "GDPR - Article 12",
      "GDPR - Article 15"
    ],
    "title": "D.A.A.A (Claimant) v. Hospital Recoletas Ponferrada, S.L.",
    "url": "https://www.deceptive.design/cases/d-a-a-a-claimant-v-hospital-recoletas-ponferrada-s-l"
  },
  {
    "Excerpt": "The Washpoint SL was fined by the Spanish DPA (AEPD) for two violations: first, the absence of a Privacy Policy on their website; and second, the absence of a reject button on the second layer of their Cookie Policy.",
    "Our analysis": "The case against The Washpoint SL involved a complaint filed by a claimant alleging that the company's website did not have a Privacy Notice or a Cookie Notice. Upon investigation, the Spanish DPA (AEPD) confirmed that there was indeed no link or document outlining the Privacy Policy on the website. This meant that there was no information available to users regarding the processing of their personal data. The DPA concluded that this lack of a Privacy Policy violated Article 13 of the GDPR. In addition to the Privacy Policy violation, the Spanish DPA also found that there was no mechanism to reject cookies in the second layer of the Cookie Policy. Instead, only information on how to configure browser settings in the user's terminal equipment was provided. The DPA held that this absence of a reject button on the second layer of the Cookie Policy violated Article 22(2) of the Spanish Law on services of the information society and electronic commerce (LSSI). The lack of a Privacy Policy and the absence of a reject button on the second layer of the Cookie Policy both involve deceptive patterns. In the case of the Privacy Policy, the information was hidden or not easily accessible, making it difficult for users to make informed decisions about the collection and processing of their personal data. In the case of the Cookie Policy, the absence of a reject button forces users to accept cookies without providing a clear alternative option. Both of these actions violate important privacy and data protection laws, and The Washpoint SL was fined €1000 for each violation, resulting in a total fine of €2000.",
    "Outcome": "The DPA imposed a fine of €2000 on The Washpoint SL for breaching Article 13 GDPR and Article 22(2) LSSI. A fine of €1000 was imposed for the lack of information or a privacy policy, and another €1000 fine was imposed for the lack of a reject button in the cookie banner.",
    "Related deceptive patterns": [
      "Forced action",
      "Sneaking"
    ],
    "Related laws": [
      "GDPR - Article 13",
      "Spanish Law on Information Society Services - Article 22"
    ],
    "title": "D.A.A.A (Claimant) v. Washpoint S.L.",
    "url": "https://www.deceptive.design/cases/d-a-a-a-claimant-v-washpoint-s-l"
  },
  {
    "Excerpt": "SOCIETE DU FIGARO was held responsible for allowing partners to deposit cookies on user terminals for advertising purposes without obtaining their consent or action. The company failed to provide users with effective means to refuse the deposit of cookies for advertising purposes, despite expressing their desire to do so.",
    "Our analysis": "The French DPA (CNIL) received a complaint in August 2018 regarding the installation of cookies on users' devices without their consent and prior to any action on the Société du Figaro's website. After conducting five online inspections between January 2020 and June 2021, the DPA found that the website violated the applicable laws by using deceptive patterns and forced actions on its users. The DPA found that cookies were installed on users' devices as soon as they arrived on the website, even if they had expressed a refusal to accept cookies while navigating to another page of the website. Additionally, the website failed to ensure that its partners did not emit cookies that violated the applicable regulations, and did not take the necessary steps to put an end to the breach observed. Therefore, the DPA held the website accountable for breaching its obligations regarding consent and information about cookies on its website, violating article 82 of the French data protection law.",
    "Outcome": "The CNIL Restricted Committee has determined the outcome of the case and has decided to impose an administrative fine of 50,000 euros on SOCIETE DU FIGARO for violating article 82 of the Data Protection Act. Additionally, the committee has ruled that its deliberation will be made public on both the CNIL website and the Légifrance website. However, the committee will no longer identify the companies involved in the case by name after a period of two years from its publication.",
    "Related deceptive patterns": [
      "Sneaking",
      "Forced action"
    ],
    "Related laws": [
      "French Data Protection Act - Article 82"
    ],
    "title": "D.A.A.A (Complainant) through CNIL v. Société du Figaro",
    "url": "https://www.deceptive.design/cases/d-a-a-a-complainant-through-cnil-v-societe-du-figaro"
  },
  {
    "Excerpt": "The Spanish Data Protection Authority issued a reprimand to a controller for failing to fulfill a data subject's request for deletion. Despite six separate attempts by the data subject, the controller did not act promptly, and neither their website nor app allowed for easy account cancellation.",
    "Our analysis": "The motorcycle sharing company in question utilised a deceptive pattern known as the hard to cancel to make it difficult for users to cancel their accounts. This is evidenced by the fact that the company did not provide an option for users to cancel their accounts through their website or app, and instead required the data subject to email a generic mailbox which did not accept incoming mail. Furthermore, despite the data subject's repeated requests to delete their account and data, the company failed to do so in a timely manner, which violated Article 17 of the GDPR. Additionally, the company failed to notify the data subject once their account was deleted, as required by Article 12 of the GDPR. In this case, the motorcycle sharing company made it intentionally difficult for users to cancel their accounts and delete their data, which violates the principles of transparency and fairness that are fundamental to the GDPR. The company's failure to respond to the data subject's requests and continued sending of commercial messages after the data subject had requested deletion of their data also constitutes a violation of the GDPR, specifically Article 21 which grants individuals the right to object to the processing of their personal data for direct marketing purposes.",
    "Outcome": "Despite the infringement, the DPA considered it minor due to mitigating circumstances, such as the controller's lack of prior non-compliance, temporary layoffs due to Covid-19, and prompt action taken to address the issue. As a result, the DPA issued a reprimand rather than a fine.",
    "Related deceptive patterns": [
      "Hard to cancel"
    ],
    "Related laws": [
      "GDPR - Article 12",
      "GDPR - Article 17"
    ],
    "title": "D.A.A.A. (Complainant) V. Cooltra Motosharing S.L.U.",
    "url": "https://www.deceptive.design/cases/d-a-a-a-complainant-v-cooltra-motosharing-s-l-u"
  },
  {
    "Excerpt": "The Spanish Data Protection Authority (DPA) has fined an airline for violating cookie regulations on their website. The airline failed to give users a choice, provide sufficient information, and allow users to reject all cookies at once.",
    "Our analysis": "The case of Iberia highlights the negative consequences of using deceptive patterns in cookie consent mechanisms. Iberia used a cookie consent mechanism that did not provide users with a clear and granular choice to reject cookies. Instead, users were forced to accept cookies without the ability to reject them, in violation of Article 5(3) of the e-Privacy Directive and Article 22(2) of the Spanish law on cookies (LSSI). Moreover, the airline installed cookies before obtaining the user's consent, further violating the e-Privacy Directive. The directive requires that websites obtain the user's consent before placing cookies or similar technologies on their devices, and that the consent be obtained after providing the user with clear and comprehensive information about the purposes of the processing. Additionally, Iberia provided incomplete and misleading information about cookies on its website, which violated both the e-Privacy Directive and the Spanish law on cookies. The DPA found that the airline failed to inform users about third-party cookies and the storage period of the cookies, and did not provide clear information about the purposes of the cookies.",
    "Outcome": "The Spanish DPA imposed a €30,000 fine on an airline for violating cookie regulations by not giving users a choice, offering insufficient information, and not allowing users to reject all cookies at once on their website.",
    "Related deceptive patterns": [
      "Forced action",
      "Sneaking"
    ],
    "Related laws": [
      "ePrivacy Directive - Article 5(3)",
      "Spanish Law on Information Society Services - Article 22"
    ],
    "title": "D.A.A.A. (Complainant) v. Iberia Lineas Aereas De Espana, S.A. Operadora Unipersonal",
    "url": "https://www.deceptive.design/cases/d-a-a-a-complainant-v-iberia-lineas-aereas-de-espana-s-a-operadora-unipersonal"
  },
  {
    "Excerpt": "The PREICO JURÍDICOS website was fined by the Spanish DPA for violating regulations regarding the use of cookies. The website was found to have used non-technical and non-necessary cookies without obtaining proper consent, failed to display an appropriate cookie banner, and provided insufficient information in its Cookies Policy.",
    "Our analysis": "A complaint was filed by an individual with the AEPD regarding the use of non-technical and non-necessary cookies without consent, the absence of an appropriate cookie banner, and the insufficient extent of information provided in the Cookies Policy. The AEPD recalled Article 22(2) LSSI, which mandates that website users be provided with clear and complete information on the use of storage devices, data recovery, and, in particular, on the purposes of data processing. This regulation also applies to cookies on websites, requiring the controller to explicitly obtain consent whenever non-necessary or non-technical cookies are used, such as through an \"Accept\" button. Users must be allowed to withdraw their consent at any time, as mandated by Article 7 GDPR. A cookie banner must inform users about the identity of the controller, the purposes of using specific types of cookies, the data collected, and the manner in which to accept, reject or adjust the use of cookies. Additionally, there must be a link to a page with more detailed information on the Cookies Policy. The use of \"Cookie Walls,\" which block access to a website unless the user accepts the use of cookies, is prohibited. In the present case, the AEPD found that there was no cookie banner, no possibility to reject non-technical and non-necessary cookies, and no control panel to manage cookies which amounted to a deceptive pattern of forced action. The AEPD also investigated the compliance of the information provided in the Cookies Policy with Article 22(1) LSSI and concluded that the policy lacked crucial details such as the identity of the controller, the types of cookies used, their functionality, and their active time; which amounts to hidden information.",
    "Outcome": "The Spanish Data Protection Agency (AEPD) imposed a fine of €2,000 on a controller for violating Article 22(2) of the LSSI, which requires website operators to provide users with information about the use of cookies and obtain their consent before storing them. The fine was imposed due to the website's non-compliance with the Cookies Policy implemented on their website.",
    "Related deceptive patterns": [
      "Forced action",
      "Sneaking"
    ],
    "Related laws": [
      "GDPR - Article 07",
      "Spanish Law on Information Society Services - Article 22"
    ],
    "title": "D.A.A.A. (Complainant) v. Preico Juridicos, S.L.",
    "url": "https://www.deceptive.design/cases/d-a-a-a-complainant-v-preico-juridicos-s-l"
  },
  {
    "Excerpt": "The Spanish DPA (AEPD) imposed a fine on a radio station for not including a link to their cookie policy in the cookie banner and for placing non-essential cookies on user devices without obtaining prior consent.",
    "Our analysis": "The case in question involved a radio company that was accused of violating privacy laws by a data subject who alleged that it was impossible to reject cookies on their website. Upon accessing the website, users were greeted with a banner that informed them that cookies were being used, but no link to the actual cookie policy was provided. Users were also unable to access the cookie policy before accepting the cookies. Furthermore, the company was found to have installed non-strictly necessary cookies on users' devices before obtaining their consent. These included analytical cookies like \"_cb\", \"_chartbeat2\", \"_ga\", \"_cb_svref\", \"_cb_ls\", and \"web_gid\" that were used to track user behavior and collect data on website visits. The use of such cookies without the user's consent and without providing adequate information about their use was deemed a violation of Article 22(2) of the Act on Information Society Services and Electronic Commerce, which implements the e-Privacy Directive.According to this law, service providers may only use data storage and retrieval devices on recipients' terminal equipment if they have given their consent after being provided with clear and complete information on their use, in particular on the purposes of data processing. In this case, the company was found to have violated this law in two ways. First, they installed unnecessary cookies before obtaining the user's consent, which is a clear violation of the law. Secondly, the company did not provide enough information about the processing of such cookies, as the users could not directly access the cookie policy. The cookie banner should have included a direct link to the policy or it should have been available in the second layer, as the user should have been able to access the information before providing consent. The company's actions were also found to involve deceptive patterns, which are design choices that are intentionally misleading or confusing to users. The company's decision to install cookies before obtaining consent and failure to provide clear and complete information about their use is an example of a forced action and hidden information, respectively.",
    "Outcome": "The AEPD found that the controller had breached Article 22(2) of the Act on Information Society Services and Electronic Commerce by failing to provide adequate information to users about the use of cookies and by placing unnecessary cookies without obtaining user consent. As a result, the controller was fined €2000, which was reduced by 40% to €1200 due to timely payment and admission of guilt.",
    "Related deceptive patterns": [
      "Forced action",
      "Sneaking"
    ],
    "Related laws": [
      "Spanish Law on Information Society Services - Article 22"
    ],
    "title": "D.A.A.A (Complainant) v. Radio Popular S.A.",
    "url": "https://www.deceptive.design/cases/d-a-a-a-complainant-v-radio-popular-s-a"
  },
  {
    "Excerpt": "Wind Tre was fined by the Garante for not allowing customers to withdraw consent or object to marketing data processing, lacking transparency in data information, using a single button for multiple consents, using small prints, bundled consents, and conducting unlawful data collection and unauthorised marketing.",
    "Our analysis": "Wind Tre, an Italian telecommunications company, has been found to have violated several articles of the GDPR and Italian Privacy Code by the Italian DPA (Garante) following complaints from both Wind Tre and non-Wind Tre users. The complaints related to unsolicited marketing communications made without their consent through texting, emails, faxes, and automated phone calls. This is an example of the deceptive pattern of hidden information, where Wind Tre did not provide clear information to data subjects regarding their communications channels and methods. Many complainants noted that they were unable to withdraw their consent or object to the processing of their data for marketing purposes, partly due to inaccurate contact information in Wind Tre's privacy policies. This is an example of the hard to cancel pattern, where Wind Tre made it difficult for data subjects to withdraw their consent, as their contact information was not accurate. The Garante's investigation revealed that Wind Tre's operating methods incentivized sellers to collect \"as much consent as possible\" from data subjects while impairing their ability to object to processing of data for promotional purposes. This is an example of the deceptive pattern of forced action, where Wind Tre pressured data subjects to give their consent to the processing of their personal data for commercial purposes.Deceptive patterns such as hidden information, hard to cancel, bundling of consents, and forced action were also used by the company to gain consents from data subjects. The presence of a single button in the management system to facilitate the tick of all consent boxes and small prints used to inform about consent collection were considered further negative elements by the DPA, indicating bundling of consents. Wind Tre's practices for the identification of data subjects were also found to be in violation of GDPR regulations. The company stated that it did not act on data subjects’ requests to withdraw consent if these did not come with a copy of an ID. This is an example of the deceptive pattern of hidden information, where Wind Tre did not provide clear information to data subjects regarding the information required to withdraw their consent. Overall, Wind Tre's deceptive patterns violated various GDPR articles, including Articles 5(1), 5(2), 6(1)(a), 7, 12(1), 12(2), 24, and 25.",
    "Outcome": "Wind Tre was found to have violated several articles of the GDPR, including Articles 5(1), 5(2), 6(1)(a), 7, 12(1), 12(2), 24 and 25, by the Garante. As a result, Wind Tre was fined 16,729,600 EUR, prohibited from any further processing and was ordered to align their processing practices with the requirements of the GDPR.",
    "Related deceptive patterns": [
      "Hard to cancel",
      "Forced action",
      "Sneaking"
    ],
    "Related laws": [
      "GDPR - Article 05",
      "GDPR - Article 06",
      "GDPR - Article 07",
      "GDPR - Article 12",
      "GDPR - Article 24",
      "GDPR - Article 25",
      "GDPR - Article 83",
      "Codice Privacy - Article 130"
    ],
    "title": "D.A.A.A. (Complainant) v. Wind Tre SpA",
    "url": "https://www.deceptive.design/cases/d-a-a-a-complainant-v-wind-tre-spa"
  },
  {
    "Excerpt": "Canary Click Consulting website was held liable for failure to provide information about the storage or deletion of their data and for not providing an option to reject cookies.",
    "Our analysis": "Canary Click Consulting received complaints from 10 individuals who alleged that the company promised to provide official certificates for a fee but only provided instructions on how to obtain them after the individuals entered personal data and paid the fee. Additionally, the company failed to provide information about the storage or deletion of personal data once a refund was requested. The AEPD investigated the matter and found that URL 1's privacy policy stated that personal data would only be used for \"strictly necessary purposes\" but also allowed for marketing purposes without an option for users to reject cookies. URLs 2, 3, and 4 did not have a cookie banner or a mechanism for users to reject cookies. Instead, users were directed to \"configure the browser on their terminal equipment\" to delete cookies. The dispute was whether URLs 1-4 were in violation of the GDPR. The AEPD held that Canary Click Consulting breached European and Spanish data protection laws. URL 1 breached Article 7 of the GDPR because users had to give their consent \"generically\" for all processing purposes, without the ability to withdraw consent for specific purposes like marketing. As a result, the AEPD issued a warning to Canary Click Consulting and ordered them to bring URL 1 and their privacy policy in line with Article 6(1)(a) of the GDPR within a month.",
    "Outcome": "Canary Click was fined €8,000 by the AEPD for violating Article 22(2) of the Law 34/2002 (LSSI), which implements the e-Privacy Directive in Spain. The AEPD concluded that URLs 1-4 breached this article, and the company was fined €2,000 for each URL.",
    "Related deceptive patterns": [
      "Forced action",
      "Sneaking"
    ],
    "Related laws": [
      "GDPR - Article 06",
      "GDPR - Article 07",
      "GDPR - Article 58",
      "Spanish Law on Information Society Services - Article 22"
    ],
    "title": "D.A.A.A (Data Subject) v. Canary Click Consulting website",
    "url": "https://www.deceptive.design/cases/d-a-a-a-data-subject-v-canary-click-consulting-website"
  },
  {
    "Excerpt": "The Norwegian DPA held the controller liable for direct marketing purposes to a data subject despite of having previously objected to such processing.",
    "Our analysis": "Komplett Bank ASA violated multiple articles of the GDPR, according to the Data Protection Authority. The bank sent direct marketing emails to a data subject who had previously objected to such processing under Article 21(3) GDPR. Despite claiming that the lawful basis for processing was consent under Article 6(1)(a) GDPR, the bank later revealed that it was using \"Necessary for the performance of a contract\" under Article 6(1)(b) GDPR. The DPA found that the bank had processed personal data for direct marketing purposes without a lawful basis, exceeded the time limit for responding to data subject requests under Article 12(3) GDPR, and failed to inform the data subject of their right to object to processing under Articles 13(2) and 21(4) GDPR. The bank also violated Articles 12(1) and 13(1) GDPR by providing misleading information about the lawful basis for processing personal data for direct marketing purposes.",
    "Outcome": "The DPA found that Komplett Bank ASA breached several provisions of the GDPR. Firstly, they processed personal data for direct marketing purposes without a lawful basis, which goes against Article 6(1) GDPR. Secondly, they provided misleading information about the lawful basis used for processing personal data for direct marketing purposes, which violates Articles 12(1) and 13(1) GDPR. Thirdly, the bank exceeded the time limit for responding to data subject requests for information, which is in breach of Article 12(3) GDPR. Fourthly, they failed to inform the data subject of their right to object to the processing of their personal data for direct marketing purposes, violating Articles 13(2) and 21(4) GDPR. Lastly, they disregarded the data subject's prior objection to direct marketing, which is against Article 21(3) GDPR. As a result of these violations, the DPA issued Komplett Bank ASA with a Compliance Order and Reprimand.",
    "Related deceptive patterns": [
      "Nagging",
      "Forced action"
    ],
    "Related laws": [
      "GDPR - Article 06",
      "GDPR - Article 12",
      "GDPR - Article 13",
      "GDPR - Article 21"
    ],
    "title": "D.A.A.A (Data subject) v. Komplett Bank ASA",
    "url": "https://www.deceptive.design/cases/d-a-a-a-data-subject-v-komplett-bank-asa"
  },
  {
    "Excerpt": "The DPA imposed a fine on a website as the web pages where personal data are requested, do not provide information on the company’s privacy policy.",
    "Our analysis": "ORI, S.I. faced a complaint filed by a data subject for non-compliance with GDPR regulations, specifically the lack of a privacy policy on their website. The website had multiple forms that collected personal data, but at least five of these forms did not provide information on the company's privacy policy. The DPA determined that this constituted an infringement of Article 13 GDPR, as defined in Article 83.5 GDPR, and initiated a sanctioning procedure. The resulting fine was 1,200€, imposed in accordance with the criteria outlined in Article 83.2 GDPR. The data controller was given one month to adopt appropriate measures to bring their actions into compliance with data protection regulations, including notifying the Agency of their efforts.",
    "Outcome": "The initial fine was set at 2,000€. However, the responsible party acknowledged their mistake within the given timeframe, which led to a 20% reduction in the sanction, resulting in a fine of 1,600€. They also opted for voluntary payment of the penalty, which allowed for an additional 25% reduction, bringing the total amount to 1,200€. The case was ultimately closed after the responsible party agreed to withdraw any administrative action or appeal against the sanction.",
    "Related deceptive patterns": [
      "Sneaking"
    ],
    "Related laws": [
      "GDPR - Article 05",
      "GDPR - Article 13",
      "GDPR - Article 58",
      "GDPR - Article 83"
    ],
    "title": "D.A.A.A. (Data Subject) v. ORI, S.L.",
    "url": "https://www.deceptive.design/cases/d-a-a-a-data-subject-v-ori-s-l"
  },
  {
    "Excerpt": "The Hungarian DPA fined a hotel booking service for sending direct marketing emails without valid legal basis, not obtaining separate consent for specific purposes, not expressly mentioning data processing purposes in the privacy policy.",
    "Our analysis": "A hotel booking website was fined by the Hungarian DPA for violating GDPR laws by sending unsolicited commercial emails to two data subjects. The website's privacy policy provided misleading information as it claimed the legal basis for processing personal data for newsletters and marketing was consent under Article 6(1)(a) GDPR, while mentioning the legitimate interest of the controller. This hidden information caused confusion for the data subjects as to which legal basis was actually used, violating Article 12(1) GDPR.Moreover, the controller did not obtain separate consent for specific purposes as there were no separate checkboxes for data marketing purposes, thereby amounting to bundling of consent. The DPA found a violation of Article 6(1) GDPR as the consent given by the data subjects was not informed. Additionally, the controller violated Article 7(1) GDPR as it did not have proof of consent and Article 5(2) GDPR as it did not send the requested proofs of consent or an assessment of balancing the legitimate interests at stake.",
    "Outcome": "A hotel booking service was fined €1,228 by the Hungarian DPA for sending direct marketing emails without a valid legal basis by bundling consent and not complying with GDPR data subject rights, including access, rectification, erasure, and objection to data processing under Articles 12, 15, 17, and 21(2).",
    "Related deceptive patterns": [
      "Sneaking",
      "Forced action"
    ],
    "Related laws": [
      "GDPR - Article 05",
      "GDPR - Article 06",
      "GDPR - Article 07",
      "GDPR - Article 12",
      "GDPR - Article 15",
      "GDPR - Article 17"
    ],
    "title": "D.A.A.A (Data Subjects) v. Infotv",
    "url": "https://www.deceptive.design/cases/d-a-a-a-data-subjects-v-infotv"
  },
  {
    "Excerpt": "Caixabank Bank was fined by the Spanish DPA for using pre-ticked boxes to request consent for processing personal data, and charging customers who did not accept the terms a monthly maintenance fee of €5.",
    "Our analysis": "Customers of Caixabank, complained to the Spanish Data Protection Agency (AEPD) that the bank was using a deceptive pattern application of preselection and forced action to obtain consent for processing personal data from its customers. Caixabank had asked customers to accept consent terms through pre-ticked boxes. If the customers did not accept the terms, the bank would charge them a fee of €5 per month for maintaining their bank account. This approach of preselecting the consent checkbox and then linking it to a mandatory fee for the bank account's maintenance forced the customers to provide their consent. The bank claimed that the fee was not a charge but a necessary fare for providing banking services and was an essential element of the contract. The AEPD established that during a certain period, for new customers who chose a particular type of bank account, the consent acceptance fields were pre-ticked. In the AEPD's view, linking an exemption from fees to the provision of obtaining consent for the processing of personal data would mean that the consent was not given freely, since not giving consent entailed the payment of maintenance fees, which were detrimental to the data subject.The AEPD also noted that the bank's arguments related to the offering of different banking products were not relevant in this case, since these other products had different requirements based on, customer's economic conditions, minimum purchases per month, insurance contributions, and holdings into investment funds. The AEPD also established that linking processing of personal data with a waiver of fees could not be considered analogous to a loyalty program. The AEPD held that  the two legal bases for the lawful processing of personal data (ie. consent and performance of a contract), were merged or blurred, in violation of Article 7(4) GDPR. Overall, the AEPD found Caixabank's actions to be in violation of GDPR due to the deceptive pattern application of preselection and forced action used to obtain consent for processing personal data.",
    "Outcome": "The AEPD found that Caixabank had unlawfully merged two legal bases for processing personal data - consent and performance of a contract - which violated Article 7(4) GDPR. Consequently, the AEPD imposed a €2,000,000 fine against Caixabank for breaching Article 6 GDPR in connection with Article 7(4) GDPR. Caixabank had imposed conditions that required consent for the processing of personal data, for purposes that were not necessary for the performance of a contract. Additionally, Caixabank was fined €100,000 for using pre-ticked boxes to obtain this consent, which was in violation of Article 6(1) GDPR.",
    "Related deceptive patterns": [
      "Preselection",
      "Forced action"
    ],
    "Related laws": [
      "GDPR - Article 06",
      "GDPR - Article 07"
    ],
    "title": "D.A.A.A. & Ors v. Caixabank, S.A.",
    "url": "https://www.deceptive.design/cases/d-a-a-a-ors-v-caixabank-s-a"
  },
  {
    "Excerpt": "Abanca Corporación Bancaria was found to be using unnecessary cookies on its website without obtaining prior consent from users, leading to a fine by the Spanish Data Protection Agency (AEPD).",
    "Our analysis": "The case of Abanca's use of cookies without obtaining consent from the user raises concerns about compliance with privacy regulations. The AEPD received a complaint about the installation of cookies by Abanca without consent, specifically third-party cookies from Google and Weborama that were installed before the cookie banner appeared. The AEPD found that this constitutes a violation of the cookies regulation, which requires obtaining consent before installing non-necessary cookies. Furthermore, the AEPD discovered that Abanca did not properly identify the cookies that were placed before obtaining consent in their cookie information page. This lack of transparency regarding the use of cookies violates the principles of the GDPR, which require clear and concise information to be provided to data subjects. Abanca's actions may also be in violation of Article 22(2) LSSI, which implements the e-Privacy Directive. This regulation requires that users be informed about the use of cookies and be given the opportunity to reject their installation. By installing non-necessary cookies before obtaining consent, Abanca may be seen as engaging in deceptive patterns of forced action and hidden information, which undermines the principles of transparency and user choice.",
    "Outcome": "Abanca was fined €5,000 by the AEPD, which was later reduced to €3,000 as a result of the company acknowledging its responsibility and making an early payment. The AEPD also ordered Abanca to implement necessary modifications to their websites to ensure that cookies are not used without obtaining the user's consent.",
    "Related deceptive patterns": [
      "Forced action",
      "Sneaking"
    ],
    "Related laws": [
      "Spanish Law on Information Society Services - Article 22"
    ],
    "title": "D.A.A.A. V. Abanca Corporacion Bancaria, S.A.",
    "url": "https://www.deceptive.design/cases/d-a-a-a-v-abanca-corporacion-bancaria-s-a"
  },
  {
    "Excerpt": "Miguel Ibáñez Bezanilla was fined by the Spanish DPA for multiple violations related to his website. These included the absence of a banner on cookies usage, insufficient information on the identity, features, and length of cookies, and the lack of an option to refuse them. The website was found to be technically unsafe, the privacy policy was not updated, and the provided cookie information was inadequate.",
    "Our analysis": "Miguel Ibáñez Bezanilla, S.L. was fined by the AEPD for violating various data protection regulations related to its website. The violations included the lack of safety measures for the website, the absence of data protection information and storage periods, and insufficient cookie information. The company's website required personal data such as name, surname, national ID, driving licence, chassis number, car number plate, and payment proof to make an order. However, the website did not offer a safe encryption protocol, making communication interception possible. The privacy policy was also outdated and referred to the former Spanish data protection law. Moreover, there was no banner on cookies usage, and the detailed part of the website referring to cookies did not provide information on identity, features or length, nor any option to refuse them. The defendant did not respond to AEPD's requirements, and the agency initiated a sanction procedure. The AEPD found that the defendant had violated Article 32 GDPR, Article 13 GDPR, and Article 22 LSSI due to the use of deceptive patterns such as hidden information and forced actions to conceal information and breach legal obligations.",
    "Outcome": "The defendant was ordered by AEPD to rectify all the website violations within one month of the decision and also received a fine of € 3000.",
    "Related deceptive patterns": [
      "Forced action",
      "Sneaking"
    ],
    "Related laws": [
      "GDPR - Article 13",
      "GDPR - Article 32",
      "Spanish Law on Information Society Services - Article 22"
    ],
    "title": "D.A.A.A. v. Miguel Ibanez Bezanilla S.L.",
    "url": "https://www.deceptive.design/cases/d-a-a-a-v-miguel-ibanez-bezanilla-s-l"
  },
  {
    "Excerpt": "The Spanish DPA fined the airline Vueling €18,000 for relying on pre-checked consent boxes that enabled non-essential cookies and for continuing to use non-essential cookies even after users clicked \"reject all.\"",
    "Our analysis": "The Spanish DPA imposed a fine on Vueling Airlines S.A. for violating Article 22.2 of the Spanish Law on Services of the Information Society and Electronic Commerce. The DPA found that Vueling's consent banner, which required users to accept non-essential cookies to purchase tickets, violated the law's requirement to obtain consent before installing non-essential cookies. Vueling also used deceptive patterns of preselection and forced action. While it was possible to purchase a ticket without checking the box for consent to receive ads, the box was still present and could mislead users into thinking that consent was required. Furthermore, Vueling's cookie policy allows users to revoke consent to non-essential cookies by unchecking pre-ticked boxes, but some third-party cookies were miscategorized as essential and could not be rejected. The use of pre-ticked boxes is not a valid basis for consent under the GDPR, and the LSSI also prohibits the use of such boxes for the installation of cookies. Additionally, the LSSI requires service providers to allow users to reject cookies at any time, which Vueling failed to do by miscategorizing some cookies as essential.",
    "Outcome": "The controller was fined €18,000 by the DPA for the violations, which included unauthorised processing of personal data and failure to implement adequate security measures. The initial fine of €30,000 was reduced by 40% because the controller accepted responsibility for the infractions and agreed to pay the fine before the final resolution of the sanctioning procedure.",
    "Related deceptive patterns": [
      "Preselection",
      "Forced action"
    ],
    "Related laws": [
      "Spanish Law on Information Society Services - Article 22"
    ],
    "title": "D.A.A.A v. Vueling Airlines S.A.",
    "url": "https://www.deceptive.design/cases/d-a-a-a-v-vueling-airlines-s-a"
  },
  {
    "Excerpt": "Banco Bilbao Vizcaya Argentaria, SA was fined by the Spanish Data Protection Authority (AEPD) for issues related to imprecise terminology, vague formulations, the absence of the option to refuse in the privacy policy, and the use of pre-ticked checkboxes to obtain consent.",
    "Our analysis": "Banco Bilbao Vizcaya Argentaria, SA (BBVA) faced several joint complaints related to their data processing practices. The first complainant claimed that BBVA sent promotional SMS to their mobile phone without consent, while BBVA argued that the complainant had consented by subscribing to a document on customer identification and processing of personal data. The second complainant claimed that BBVA did not comply with legal requirements for free and informed consent, as their application did not provide the possibility to refuse data processing. BBVA responded that this method of gathering consent was valid according to BBVA and other forums. The third complainant claimed that BBVA asked them to sign a privacy policy document to unblock their account, which included a ticked option that stated they did not want BBVA to process their data for certain purposes. The fourth complainant claimed that they received unauthorised advertising communications, and BBVA argued that the complainant did not oppose this data processing in the privacy policy document they signed. The fifth complainant claimed they received unsolicited calls and SMS, and BBVA argued that the complainant had consented to such processing of personal data for commercial purposes by signing a privacy policy document.The Spanish DPA investigated the issue and held that BBVA's privacy policy lacked clarity and specificity, which violated Articles 12, 13, and 14 of the GDPR. The DPA stated that BBVA must respect the obligations outlined in Article 13 and 14 in conjunction with Article 5(1)(a) as a data controller that processes personal data. BBVA's privacy policy used imprecise terminology and vague formulations when providing information to the data subject. The DPA found that BBVA did not design a specific mechanism to collect valid consent when relying on consent as a legal basis for processing personal data for certain purposes, and the data subject's options were limited in the way BBVA presented the boxes to tick. BBVA relied on the \"inaction\" of the data subject to gather consent, which was in breach of GDPR's requirements for gathering valid consent. A general signature of the privacy policy could not be valid consent as it was not specific to distinct purposes, and the consent given was not informed as the privacy policy lacked crucial information. The DPA referred to the Article 29 Working Party Guidelines on transparency to highlight that BBVA's privacy policy fell within the examples of poor transparency practices. The privacy policy was too vague and unclear, making it difficult for data subjects to understand.",
    "Outcome": "Banco Bilbao Vizcaya Argentaria, SA was fined €2 million for violating the transparency principle and €3 million for breaching the legality of processing under Article 6 of GDPR by the Spanish Data Protection Authority (AEPD).",
    "Related deceptive patterns": [
      "Preselection",
      "Forced action",
      "Sneaking"
    ],
    "Related laws": [
      "GDPR - Article 04(11)",
      "GDPR - Article 05",
      "GDPR - Article 07",
      "GDPR - Article 12",
      "GDPR - Article 13",
      "GDPR - Article 14",
      "GDPR - Article 21",
      "Spanish Data Protection Law (LOPDGDD) - Article 6",
      "Spanish Data Protection Law (LOPDGDD) - Article 11"
    ],
    "title": "D.AAA (claimant) v. Banco Bilbao Vizcaya Argentaria, SA",
    "url": "https://www.deceptive.design/cases/d-aaa-claimant-v-banco-bilbao-vizcaya-argentaria-sa"
  },
  {
    "Excerpt": "The DPA held a public entity liable as the details were not easy to find on the website, and were only accessible in English, and not in any of the official languages.",
    "Our analysis": "In 2018, the Luxembourg DPA initiated 25 audit proceedings related to the role of the Data Protection Officer (DPO) under the GDPR. One of the audits involved a public entity in Luxembourg, which was found to be in breach of four distinct obligations related to the role of the DPO under the GDPR. The head of investigation found that the entity had failed to publish the contact details of its DPO on its website in a way that made them easily accessible for data subjects, which violated Article 37(7) GDPR. The contact details were difficult to find and only available in English, rather than any of the official languages of Luxembourg. Although the controller addressed this issue during the investigation by publishing the contact details of the DPO in another language on its website, the CNPD still considered it to be a breach of Article 37(7) GDPR.",
    "Outcome": "The CNPD (National Data Protection Authority) has taken action against the controller for non-compliance with the GDPR, issuing an injunction that requires the controller to remedy any remaining breaches within a specified period of six months. In addition, an administrative fine of €18,000 has been imposed on the controller.",
    "Related deceptive patterns": [
      "Trick wording"
    ],
    "Related laws": [
      "GDPR - Article 37",
      "GDPR - Article 38",
      "GDPR - Article 39"
    ],
    "title": "Decision of the National Commission sitting in restricted formation on Deliberation n°38FR/2021",
    "url": "https://www.deceptive.design/cases/decision-of-the-national-commission-sitting-in-restricted-formation-on-deliberation-ndeg38fr-2021"
  },
  {
    "Excerpt": "The French DPA fined Apple for implementing the ‘personalised ads’ setting as default without prior consent and making it hard to change the setting by involving multiple steps.",
    "Our analysis": "The CNIL received a complaint regarding ad personalization in the App Store and conducted several investigations in 2021 and 2022 to ensure compliance with regulations. It was found that under the previous version 14.6 of the iPhone operating system, identifiers were automatically read without obtaining consent when a user visited the App Store, which was used for personalization of ads. The complaint focused on the default activation of the \"Personalized Advertisements\" privacy setting in the iOS and MacOs operating systems of devices sold by Apple. This default setting did not allow users to validly consent to advertising targeting processing, and required them to perform multiple actions to disable it. The DPA stated that this made it difficult for users to give prior consent, as the option was not integrated into the phone's initialization process and was buried too deep in the settings. As a result, the DPA determined that Apple violated Article 82 of the French Data Protection Act.",
    "Outcome": "Apple was found to have contravened Article 82 of the French Data Protection Act by the DPA. Although Apple made efforts to address the shortcomings of iOS 14.6 by introducing a new consent box in iOS 15, this was deemed insufficient to fully address the breaches that occurred. Consequently, the DPA imposed a fine of €8,000,000 on Apple after taking into account various mitigating and aggravating factors.",
    "Related deceptive patterns": [
      "Preselection",
      "Hard to cancel",
      "Obstruction"
    ],
    "Related laws": [
      "GDPR - Article 04(11)",
      "French Data Protection Act - Article 82"
    ],
    "title": "Deliberation of the Restricted Committee concerning Apple Distribution International",
    "url": "https://www.deceptive.design/cases/deliberation-of-the-restricted-committee-concerning-apple-distribution-international"
  },
  {
    "Excerpt": "The French DPA found Facebook guilty for making it more complex for users to refuse cookies than to accept them, and for not providing users with clear information on refusal of cookies.",
    "Our analysis": "When a user in France visits Facebook's website, they can easily agree to the deposit of advertising cookies by clicking on the \"Accept cookies\" button on the first window. However, to refuse these cookies, the user must complete three separate actions. First, they must click on the \"Manage data settings\" button located above the \"Accept cookies\" button in the first window. Second, they must scroll down the entire content of the second window, specifically to establish that the two sliding buttons allowing the deposit of advertising cookies are disabled by default. Finally, they must click on the \"Accept all\" button located at the bottom of this second window.The restricted committee has concluded that this complex mechanism for rejecting cookies amounts to discouraging users from refusing cookies and encouraging them to favor the \"Accept cookies\" button. The methods used by Facebook to express choice in refusing cookies skew the expression of choice in favor of consent and alter freedom of choice. By having to click on \"Manage data settings\" and understanding the setup of the page to reject cookies, the user is likely to become discouraged and ultimately choose to accept cookies. Additionally, the information referring to acceptance/rejection of cookies was unclear, making it difficult for users.Facebook's website utilizes deceptive patterns, such as forced action, obstruction, and hidden information, to discourage users from refusing advertising cookies and to favor the \"Accept cookies\" button. By doing so, Facebook has violated several laws, including Article 82 of the French Data Protection Act, Article 4(11) of the GDPR, and Article 5(3) of the ePrivacy Directive. Facebook's use of deceptive patterns is counter-intuitive, as users must click on a button titled \"Accept cookies\" to refuse the deposit of cookies. This method instead encourages the user to believe that it is not possible to continue browsing if they refuse the deposit of advertising cookies.",
    "Outcome": "The CNIL imposed a fine of €60,000,000 on Facebook Ireland Limited for violating Article 82 of the Loi 'Informatique et Libertés'. Facebook was also ordered to simplify its methods for obtaining consent from French users to read and write information on their terminals. The CNIL attached a penalty of €100,000 per day of delay to the injunction, with proof of compliance required within three months. The decision was made public on the CNIL and Légifrance websites, with the company's name to be removed after two years.",
    "Related deceptive patterns": [
      "Forced action",
      "Obstruction",
      "Sneaking"
    ],
    "Related laws": [
      "French Data Protection Act - Article 82",
      "ePrivacy Directive - Article 5(3)",
      "GDPR - Article 04(11)"
    ],
    "title": "Deliberation of the Restricted Committee concerning Facebook Ireland Limited",
    "url": "https://www.deceptive.design/cases/deliberation-of-the-restricted-committee-concerning-facebook-ireland-limited"
  },
  {
    "Excerpt": "Google LLC and Google Ireland Limited required users to go through several steps to refuse cookies, and for not providing a “refuse all” button in the first layer of the cookie notice.",
    "Our analysis": "The hard to cancel pattern was used by Google, making it easy for users to accept all cookies immediately on the first step of the cookie information notice, but requiring several steps to refuse cookies. CNIL found that this practice violated Article 5(3) of the ePrivacy Directive, which requires clear and comprehensive information on the purposes of cookies and the ability to refuse them. Google also used false hierarchy by presenting the “Accept all” option more prominently than the “Reject” option. This made it seem like accepting cookies was the default and expected option, while refusing them was a secondary, less important choice. The CNIL found this to be a violation of Article 82 of the French Data Protection Act, which requires clear and explicit consent for data processing activities. The practice of Obstruction can be seen as making it unnecessarily complex for users to exercise their right to refuse cookies. The company required users to go through several layers of information and additional steps to refuse cookies, making it harder for them to opt-out. This practice also violated Article 82 of the French Data Protection Act, which requires that users can easily exercise their rights under the law.",
    "Outcome": "CNIL’s restricted committee decided to impose an administrative fine of €90,000,000 on Google LLC and €60,000,000 on Google Ireland Limited for violating Article 82 of the French Data Protection Act. Additionally, the committee issued an injunction against both companies to modify the methods of obtaining user consent on google.fr and youtube.com websites. The companies were required to provide users with a means of rejecting the operations presenting simplicity equivalent to the mechanism provided for acceptance in order to guarantee the freedom of their consent.",
    "Related deceptive patterns": [
      "Hard to cancel",
      "Visual interference",
      "Obstruction"
    ],
    "Related laws": [
      "French Data Protection Act - Article 82",
      "ePrivacy Directive - Article 5(3)"
    ],
    "title": "Deliberation of the Restricted Committee concerning Google LLC and Google Ireland Limited",
    "url": "https://www.deceptive.design/cases/deliberation-of-the-restricted-committee-concerning-google-llc-and-google-ireland-limited"
  },
  {
    "Excerpt": "The French DPA fined Microsoft for installing non-essential cookies without valid consent and making refusal of cookies harder than accepting them by placing them on a second layer.",
    "Our analysis": "In 2020 and 2021, the French data protection authority, CNIL, conducted an investigation into Microsoft's search engine, \"bing.com\", following a complaint about the site's cookie deposition practices. The investigation revealed that when users visited the search engine, cookies were being deposited on their terminals without their consent, and these cookies were being used for advertising purposes. Furthermore, it was discovered that there was no option for users to easily refuse cookies. It took two clicks to refuse all cookies, compared to just one click to accept them. The CNIL committee considered this to be a violation of users' freedom of consent as it discouraged users from refusing cookies and favored the ease of accepting them.During the investigation, the CNIL delegation followed the path of a typical user to identify if cookies were being placed on the user's equipment. They visited the \"bing.com\" domain and continued browsing the search engine without clicking on any of the buttons or links displayed on the cookie management banner. Eventually, they were blocked by a pop-up window and clicked on the \"Privacy statement\" and \"More options\" links located on the window. From the \"More options\" link, the delegation authorized the deposit of cookies on their terminal by clicking on the \"Allow all\" button. The Restricted Committee concluded that until March 29, 2022, when a \"Refuse all\" button was implemented, the conditions for collecting consent that were offered to users constituted a violation of the law. The committee believed that the more complex refusal mechanism discouraged users from refusing cookies and encouraged them to favor the ease of the consent button appearing in the first window.",
    "Outcome": "Despite arguments made by MIOL that \"bing.com\" was in a vulnerable position in a market dominated by one player, the outcome of the case was determined by several factors. These included the extent of illegal data processing, which impacted 11 million unique visitors in September 2020, the fact that \"bing.com\" was the second strongest player in the search engine market, the default use of the search engine for Windows queries, and the financial gains obtained by MIOL from the breach. As a result of the case, the DPA imposed a fine of EUR 60,000,000 on MIOL and required them to rectify their cookie implementation. Failure to comply with this requirement would result in a penalty payment of EUR 60,000 per day after the DPA's deadline.",
    "Related deceptive patterns": [
      "Sneaking",
      "Forced action",
      "Obstruction",
      "Visual interference"
    ],
    "Related laws": [
      "GDPR - Article 04(11)",
      "ePrivacy Directive - Article 5(3)",
      "French Data Protection Act - Article 82"
    ],
    "title": "Deliberation of the Restricted Committee concerning Microsoft Ireland Operations Limited",
    "url": "https://www.deceptive.design/cases/deliberation-of-the-restricted-committee-concerning-microsoft-ireland-operations-limited"
  },
  {
    "Excerpt": "VOODOO was fined by the French DPA for not obtaining user consent for personalized advertising and for providing false information about user tracking behavior. Users were presented with a misleading choice of accepting or declining tracking, followed by a second window requiring acceptance of the provider's data protection policy.",
    "Our analysis": "The provider, VOODOO, presented the user with two windows - the first window was designed by APPLE, which sought consent from the user to let the provider track their activities on the provider's applications, and the second window was designed by the provider, which required the user to certify that they were over the age of sixteen and accept the provider's personal data protection policy. Regardless of the option the user chose in the first window, the provider presented the second window, which made it seem like the user had no choice but to accept the provider's personal data protection policy. This false hierarchy created a misleading impression that the provider's policy was superior to the user's preference. By doing so, the provider reduced the effectiveness of the choice expressed by the user to decline tracking in the first window. The provider still tracked the user by using a different cookie called IDFV to collect information for advertising purposes. The provider also collected other information specific to the user's device (such as system language, device model, etc.), which it used to provide non-personalised advertisements based on browsing habits. The actions of the provider violated Article 82 of the French Data Protection Act, which transposes Article 5(3) of the ePrivacy Directive. According to this law, any subscriber or user of an electronic communications service must be informed in a clear and complete manner. The DPA determined that the information provided by the controller in the second window did not correspond with the reality of the situation. Therefore, the provider did not inform the user in a clear and complete manner, which is a violation of the law.",
    "Outcome": "The provider was fined €3,000,000 by the French DPA, who took into account the number of individuals affected, the financial gains resulting from the breach, and the provider's turnover in 2020 and 2021 when justifying the amount. Alongside the penalty, the French DPA instructed the provider to obtain explicit consent from users for the use of IDFV in advertising, within three months of receiving the decision.",
    "Related deceptive patterns": [
      "Forced action",
      "Visual interference"
    ],
    "Related laws": [
      "French Data Protection Act - Article 82",
      "ePrivacy Directive - Article 5(3)"
    ],
    "title": "Deliberation of the Restricted Committee on Voodoo",
    "url": "https://www.deceptive.design/cases/deliberation-of-the-restricted-committee-on-voodoo"
  },
  {
    "Excerpt": "TikTok was fined by the French DPA for implementing advertising identifiers without consent and for having an insufficiently informative cookie banner. The banner allowed users to accept all cookies with one click, making it difficult to refuse them, and some advertising cookies were placed even if a user did not consent.",
    "Our analysis": "The case analysis involves TikTok's violation of Article 82 of the French Data Protection Act regarding its use of cookies and its cookie banner. The investigation by the French DPA found that TikTok's cookie banner did not provide users with enough information and options to give informed consent. The DPA identified several deceptive patterns that TikTok used, such as hard-to-cancel, forced action, and hidden information, in its cookie banner. The banner allowed users to accept all cookies with a single click using a single button, making it easier to accept cookies than to deny them. Users who did not take any action on the banner would also see it remain displayed on the web page without being informed of the consequences of their inactivity. Additionally, certain advertising cookies would still be placed even if a user did not consent to their installation. The DPA held that users must be informed in a clear and complete manner, which TikTok failed to do. TikTok's cookie banner only provided general descriptions, and the user could not determine what types of content would be presented to them or in what form it would be presented. The DPA also found that TikTok did not inform users whether the provider's cookies were for analytical data and/or marketing purposes, making it impossible to give free and informed consent. TikTok was fined €2,500,000 for the lack of valid consent and €2,500,000 for providing imprecise information on its consent banner. The case serves as a reminder to companies to ensure that their cookie banners provide users with enough information and options to give informed consent, and to avoid using deceptive patterns such as hard-to-cancel, forced action, and hidden information.",
    "Outcome": "TikTok has been fined a total of €5,000,000 by the Data Protection Authority (DPA) for violating the General Data Protection Regulation (GDPR). The fine was divided into two parts - €2,500,000 for failing to obtain valid consent from users and €2,500,000 for displaying imprecise information on its consent banner. The DPA considered various mitigating and aggravating factors before deciding on the amount of the fine.",
    "Related deceptive patterns": [
      "Hard to cancel",
      "Forced action",
      "Sneaking"
    ],
    "Related laws": [
      "French Data Protection Act - Article 82"
    ],
    "title": "Deliberation of the restricted formation SAN-2022-027 concerning TikTok",
    "url": "https://www.deceptive.design/cases/deliberation-of-the-restricted-formation-san-2022-027-concerning-tiktok"
  },
  {
    "Excerpt": "The Danish DPA found Den Blå Avis at fault for using a single 'accept' button for processing data for different purposes, disclosing data to third parties without sufficient notice, and not providing a link or menu for the purpose of data sharing.",
    "Our analysis": "Den Blå Avis (DBA), an online platform for second-hand goods, was found to be using deceptive patterns by the Danish DPA during their processing of personal data of website visitors. The DPA's investigation revealed that DBA had not obtained valid consent from visitors due to hidden information and bundling of consent. By clicking \"accept,\" personal data was processed for multiple purposes, including marketing and personalisation, without clearly stating these purposes. Furthermore, DBA did not adequately inform visitors that their data would be shared with third parties, nor did they provide a link or menu in relation to the purpose for data sharing. The DPA assessed the second consent manager and found that the issues with the first CMP were still present, concluding that neither consent manager was adequate to obtain consent in accordance with Article 4(11) GDPR. The processing was therefore not in compliance with the principle of legality, reasonableness, and transparency outlined in Article 5(1)(a) GDPR.",
    "Outcome": "The DPA ultimately concluded that the data subject's interests were of greater importance than the controller's legitimate interest, and as a result, the controller could not rely on Article 6(1)(f) GDPR for processing data for statistical purposes. Despite criticizing the controller's actions, the DPA did not exercise any corrective powers under Article 58(2) GDPR.",
    "Related deceptive patterns": [
      "Sneaking",
      "Forced action"
    ],
    "Related laws": [
      "GDPR - Article 04(11)",
      "GDPR - Article 05",
      "GDPR - Article 06"
    ],
    "title": "Den Blå Avis' Ex Officio Investigation by Danish DPA",
    "url": "https://www.deceptive.design/cases/den-bla-avis-ex-officio-investigation-by-danish-dpa"
  },
  {
    "Excerpt": "DoorDash was held liable for deceiving consumers by falsely portraying the impact of their tips on Dasher pay and encouraging tips under false pretenses.",
    "Our analysis": "Between approximately 2017 and 2019, DoorDash engaged in unlawful trade practices, specifically violating the Consumer Protection Procedures Act (CPPA), including D.C. Code § 28-3904(f), (f-1), and (e).- DoorDash's deceptive design revolved around its tipping practices on its online website. It misled consumers by providing false information about how their tips were distributed to delivery personnel, creating a misleading impression that tips significantly impacted Dasher pay. Concurrently, important facts were omitted, leaving consumers uninformed that their tips had little to no influence on Dasher compensation in most cases.- DoorDash's communication with consumers was often ambiguous, failing to adequately disclose that tips did not significantly affect Dasher pay. Despite encouraging customers to tip, the company's payment scheme effectively reduced its own contributions to employee wages, creating a deceptive practice that ran afoul of the District's consumer protection laws.",
    "Outcome": "DoorDash will pay $2.5 million as part of a case resolution. They are now required to ensure that consumer tips go entirely to workers without affecting their base pay. DoorDash must also provide clear, upfront information to consumers about worker compensation and any changes to tipping practices or payment models. This includes itemized charge breakdowns at checkout and detailed payment summaries for workers after each delivery.",
    "Related deceptive patterns": [
      "Sneaking"
    ],
    "Related laws": [
      "District’s Consumer Protection Procedures Act § 28-3904"
    ],
    "title": "District of Columbia v. DoorDash",
    "url": "https://www.deceptive.design/cases/district-of-columbia-v-doordash"
  },
  {
    "Excerpt": "Grubhub fined for promises of \"free\" orders via subscription, unauthorised restaurant listings, and hidden fees.",
    "Our analysis": "In March, DC Attorney General Karl Racine filed a lawsuit against Grubhub. Grubhub was accused of falsely promising \"free\" online orders to customers and \"unlimited free delivery\" for Grubhub Plus subscribers. The lawsuit alleges that Grubhub still charged service fees for non-pickup orders from Grubhub Plus customers and both delivery and service fees for standard orders. Grubhub was also criticized for bundling service fees with sales taxes and listing restaurants on the platform without their permission. Grubhub launched microsites resembling real restaurant sites to route orders through their platform. Grubhub refuted the claims but stated that some practices had been discontinued. Grubhub settled the lawsuit and placed refundable credits in the accounts of affected customers.",
    "Outcome": "Under the settlement, affected customers will receive $2.7 million in refunds, distributed as refundable credits to Grubhub accounts, with unclaimed funds being issued as checks after 90 days; additionally, a civil penalty of $800,000 will be collected by the District; Grubhub is mandated to transparently display fees and price differences at checkout.",
    "Related deceptive patterns": [
      "Hidden Costs",
      "Forced action"
    ],
    "Related laws": [
      "District’s Consumer Protection Procedures Act § 28-3904"
    ],
    "title": "District of Columbia v. Grubhub",
    "url": "https://www.deceptive.design/cases/district-of-columbia-v-grubhub"
  },
  {
    "Excerpt": "Instacart was held liable for misrepresenting and omitting material facts concerning the default, variable service fee added to consumers' orders.",
    "Our analysis": "Between September 2016 and April 24, 2018, Instacart was found to have engaged in unlawful trade practices under the CPPA (Consumer Protection Procedures Act), as specified in D.C. Code § 28-3904(f), (f-1), and (e).- Instacart omitted material facts related to the default service fee when presenting it to consumers, including the crucial information that this fee was not intended as a Shopper tip.- Instacart's actions in this case can be characterized as sneaking as the consumers were lured into a transaction under false pretenses because vital information is hidden. In this instance, Instacart's deceptive design involved obscuring critical details about the service fee default, creating a misleading environment for consumers.",
    "Outcome": "In a case outcome determined through a consent order, Instacart is prohibited from engaging in any conduct that contravenes the CPPA (Consumer Protection Procedures Act). Instacart is also barred from making misleading misrepresentations or material omissions regarding the purpose of fees on consumers' orders. Additionally, Instacart is required to pay a total of $1,800,000.00 to settle this litigation with the District.",
    "Related deceptive patterns": [
      "Sneaking"
    ],
    "Related laws": [
      "District’s Consumer Protection Procedures Act § 28-3904"
    ],
    "title": "District of Columbia v. Maplebear, Inc. D/B/A Instacart",
    "url": "https://www.deceptive.design/cases/district-of-columbia-v-maplebear-inc-d-b-a-instacart"
  },
  {
    "Excerpt": "The ICO issued a penalty against Unite the Union for unsolicited direct marketing calls despite having explicitly opted out and by those who had not given informed valid consent to receive such calls.",
    "Our analysis": "In this case, the Information Commissioner was investigating whether Unite the Union had violated Regulation 21 of the Privacy and Electronic (EC Directive) Regulations 2003 (PECR) by contacting individuals to promote life insurance without their consent. The Commissioner received 27 complaints from individuals who claimed to have received unsolicited calls despite not giving consent, and two complainants explicitly opted out of such marketing but still received further calls. The Commissioner discovered that 57,665 calls were made to individuals registered with the Telephone Preference Service Ltd (TPS) for 28 days or longer, which is prohibited under Regulation 21 unless consent is given. The Commissioner found that Unite did not provide sufficient information to individuals about the use of their personal information, and that the individuals were only \"broadly informed,\" which is not enough to establish valid consent. The Commissioner determined that this violation of Regulation 21 was serious and warranted a monetary penalty. However, the Commissioner found that Unite did not deliberately set out to contravene the PECR, but was negligent in not making use of the resources provided by the Information Commissioner's Office. The Commissioner found that Unite failed to take reasonable steps to prevent the risk of contravention materializing and considered the complaints of 27 individuals to be sufficient to warrant a monetary penalty.",
    "Outcome": "The Commissioner issued a monetary penalty in the sum of £45 000 (to be discounted with 20% to £36 000 in the event that the fine is paid timeously and no appeal pursued).",
    "Related deceptive patterns": [
      "Nagging",
      "Hard to cancel"
    ],
    "Related laws": [
      "GDPR - Article 32",
      "GDPR - Article 42",
      "GDPR - Article 43",
      "Privacy and Electronic Communications (EC Directive) Regulation 2003 - Regulation 21"
    ],
    "title": "Enforcement Action by ICO against Unite the Union",
    "url": "https://www.deceptive.design/cases/enforcement-action-by-ico-against-unite-the-union"
  },
  {
    "Excerpt": "Groupe Rossel & Cie, a press group, was found to have unlawfully obtained user consent for the management of non-essential cookies on its websites through the ‘further browsing’ technique, which unlawfully coupled the users' expression of cookie consent with the choice to continue to the website.",
    "Our analysis": "Groupe Rossel, a Belgian press group, was found to have committed several violations by the Belgian DPA in their management of non-essential cookies on several of its websites. The DPA’s inspection service found that Groupe Rossel had used non-essential cookies before obtaining valid consent from website users, including cookies placed by third-party domains, violating Article 6(1)(a) of the GDPR. The company had also unlawfully obtained user consent by using the ‘further browsing’ technique [involves presenting visitors with a message that asks for their consent to use cookies or other tracking tools, but makes it seem like they have no other choice if they want to continue using the website. The message typically displays a button with text like “continue browsing” or “agree” to nudge visitors into giving consent] and coupling users’ expression of cookie consent with the choice to continue to the website, contrary to Articles 4(11) and 7(1) of the GDPR. Additionally, Groupe Rossel had placed further cookies on its websites without an appropriate justification after user consent had been withdrawn, violating Article 7(3) of the GDPR, which requires the user to provide consent through a clear and affirmative action.The company’s cookie policy on relevant websites was also incomplete and not sufficiently accessible, in violation of Articles 12(1), 13, and 14 of the GDPR. The lack of essential information, such as the names of all third-party partners, prevented users from making an informed decision about their data. Groupe Rossel disputed some of the findings, including the placement of statistical and social-network cookies prior to consent, the qualification of ‘further browsing’ as consent, and the use of pre-ticked boxes to grant consent for third-party cookies. The company was also found to have unjustified retention periods for the storage of cookies, and revoking consent was impossible.",
    "Outcome": "Groupe Rossel was fined €50,000 by the Belgian DPA for violating GDPR, and was ordered to publish the decision on its website. The DPA also instructed the company to bring its personal data processing practices into compliance within three months.",
    "Related deceptive patterns": [
      "Preselection",
      "Forced action",
      "Obstruction",
      "Sneaking"
    ],
    "Related laws": [
      "GDPR - Article 04(11)",
      "GDPR - Article 06",
      "GDPR - Article 07",
      "GDPR - Article 12",
      "GDPR - Article 13",
      "GDPR - Article 14"
    ],
    "title": "Executive-committee of the Belgian DPA (GBA) v. Rossel & Cie",
    "url": "https://www.deceptive.design/cases/executive-committee-of-the-belgian-dpa-gba-v-rossel-cie"
  },
  {
    "Excerpt": "The Belgian DPA fined Roularta, for several violations regarding the use of cookies such as placing unnecessary cookies, placing statistical cookies without obtaining consent, using pre-ticked boxes to grant consent for cookies from partners, providing false and inadequate information in their privacy policy, and making it impossible to revoke consent.",
    "Our analysis": "The Belgian DPA began investigating Roularta Media Group's use of cookies on Belgian media websites. The investigation uncovered several potential violations of data protection laws, including the preselection of unnecessary cookies before the data subject's consent, the placement of statistical cookies without consent, pre-ticked boxes to grant consent for cookies from partners, hidden information in their privacy policy, unjustified retention periods for the storage of cookies, and the inability to revoke consent. The controller argued that statistical cookies are necessary for the business model of the website and do not process personal data, thus making GDPR inapplicable. They also argued that the personal data for statistical cookies was anonymised, and there were no adequate guidelines provided by the Belgian DPA for companies to comply with GDPR.The DPA found that cookies can only be placed without prior consent when they are strictly necessary for communication transmission or explicitly requested by the user. The controller violated Article 6(1)(a) of GDPR by placing unnecessary cookies without prior consent. The DPA noted that statistical cookies also require prior consent and revealed IP-addresses to the controller, making them indirectly identifiable, and thus GDPR applicable. The pre-ticked boxes for cookies from partner companies cannot constitute lawful consent, violating Article 6(1)(a). The disclaimer for third-party cookies violated the principle of accountability, and the privacy policy contained false, incomplete, and insufficient information, violating Article 12(1). The controller also violated Article 5(1)(e) by not proactively defining criteria for the storage of cookies. The inability to withdraw consent violated Article 7(3). The DPA held that the absence of guidelines is not a valid excuse for violating data protection legislation, as it is the controller's responsibility to comply with the law. Numerous guidelines for compliance with GDPR already exist.",
    "Outcome": "The DPA determined that it is the responsibility of the controller to comply with the law, and the DPA noted that numerous guidelines for companies to ensure compliance with the GDPR already exist. As a result of a violation of data protection legislation, the DPA fined the controller €50,000 and ordered the controller to bring its processing of personal data into compliance with the GDPR within 3 months.",
    "Related deceptive patterns": [
      "Preselection",
      "Forced action",
      "Sneaking"
    ],
    "Related laws": [
      "GDPR - Article 04(11)",
      "GDPR - Article 05",
      "GDPR - Article 06",
      "GDPR - Article 07",
      "GDPR - Article 12",
      "GDPR - Article 24"
    ],
    "title": "Executive-committee of the Belgian DPA (GBA) v. Roularta Media Group",
    "url": "https://www.deceptive.design/cases/executive-committee-of-the-belgian-dpa-gba-v-roularta-media-group"
  },
  {
    "Excerpt": "ABCmouse agreed to pay $10 million and change its marketing and billing practices after the FTC found it misled consumers about cancellations, withheld information and charged memberships without consent.",
    "Our analysis": "Age of Learning operates a membership-based online learning tool called ABCmouse Early Learning Academy for children between two and eight years old. ABCmouse failed to clearly disclose to consumers that their subscriptions would renew automatically, leading to additional charges, and made it difficult for them to cancel their memberships. The company also failed to disclose important information related to negative option plans, including the total amount consumers would be charged if they did not act to cancel and the deadlines by which they must cancel to avoid unwanted charges.Consumers who tried to cancel by calling or emailing ABCmouse or submitting a customer support form were required to navigate a confusing process, often preventing many consumers from completing their cancellations. The company records show that hundreds of thousands of consumers who visited the ABCmouse cancellation path remained subscribed between 2015 and 2018.The Federal Trade Commission has charged Age of Learning, the company that operates ABCmouse, with deceptive marketing and billing practices that violated several laws, including Section 5(a) of the FTC Act and Section 4 of the Restore Online Shoppers' Confidence Act (ROSCA). The company was accused of using deceptive tactics, including forced continuity, hidden information, and the hard to cancel approach to prevent consumers from canceling their memberships.",
    "Outcome": "ABCmouse agreed to a proposed settlement order with the Federal Trade Commission that includes a $10 million judgment and new marketing and billing practices. The order prohibits the company from making misrepresentations about negative option plans and requires clear disclosure of cancellation procedures, charges, and deadlines. Additionally, ABCmouse must explain key terms and obtain informed consent before enrolling consumers in automatic billing programs, as well as providing simple cancellation mechanisms.",
    "Related deceptive patterns": [
      "Hidden subscription",
      "Hard to cancel",
      "Sneaking"
    ],
    "Related laws": [
      "Federal Trade Commission Act - Section 5(a), 15 U.S.C. § 45(a)",
      "ROSCA - Section 4, 15 U.S.C. § 8403",
      "ROSCA - Section 4, 15 U.S.C. § 8401",
      "ROSCA - Section 4, 15 U.S.C. § 8402",
      "ROSCA - Section 4, 15 U.S.C. § 8404",
      "ROSCA - Section 4, 15 U.S.C. § 8405"
    ],
    "title": "Federal Trade Commission v. Age of Learning, Inc. (ABCmouse)",
    "url": "https://www.deceptive.design/cases/federal-trade-commission-v-age-of-learning-inc-abcmouse-and-abcmouse-com"
  },
  {
    "Excerpt": "Effen Ads tricked users by sending spam emails that falsely claimed endorsements from news organizations and celebrities to promote fraudulent schemes.",
    "Our analysis": "Effen Ads, LLC and its owners collaborated with an affiliate marketing network, W4 LLC, to promote a fraudulent work-from-home scheme using spam emails sent to consumers. These emails falsely claimed to be from reputable news organizations like CNN or Fox News in the \"from\" lines and misleadingly suggested endorsements from well-known figures like Warren Buffett and Suze Orman in the \"subject\" lines.- The case revealed that these deceptive emails directed recipients to websites featuring fabricated news stories and false celebrity endorsements. Upon clicking the links, consumers were redirected to websites promoting Effen Ads' work-from-home schemes, which operated under various brand names.This deceptive practice not only violated Section 5(a)(1) of the CAN-SPAM Act, 15 U.S.C. § 7704(a)(1), but also relied on fake social proof to deceive consumers.",
    "Outcome": "Effen Ads has been ordered to pay more than $1.4 million and is prohibited from misrepresenting or assisting others in misrepresenting material facts, including claims involving celebrity endorsements, truthful endorsements, independent user endorsements, impartial reviews, typical consumer experiences, objective news reports, and independent product testing.",
    "Related deceptive patterns": [
      "Fake social proof"
    ],
    "Related laws": [
      "CAN-SPAM Act - Section 5(a)(1) & 15 U.S.C. § 7704(a)(1)"
    ],
    "title": "Federal Trade Commission v. Effen Ads, LLC",
    "url": "https://www.deceptive.design/cases/federal-trade-commission-v-effen-ads-llc"
  },
  {
    "Excerpt": "Sage Auto coerced users to sign different contracts, charged for unauthrosied add-ons and faked its reviews.",
    "Our analysis": "FTC took action against the Sage Auto Group for employing deceptive tactics in their auto sales and financing practices. The defendants utilized \"yo-yo\" financing tactics, pressuring consumers who had already signed contracts and driven off the dealership lots into accepting different, less favorable deals.-They also added unauthorized charges for aftermarket products and services to consumers' car financing agreements. The defendants enticed consumers, including financially distressed and non-English speaking individuals, through various forms of advertising, including print, internet, radio, and television, making misleading claims about vehicle availability, low prices, low monthly payments, and low down payments.-Additionally, they deceptively offered lease agreements as purchase options and falsely claimed they would pay off consumers' trade-in vehicles when consumers remained responsible for any outstanding amounts.-Furthermore, the defendants were alleged to have used fraudulent online reviews to promote their dealerships and discredit negative feedback related to their illegal practices. They and their agents posted positive, five-star reviews that appeared to be from impartial reviewers but failed to disclose their affiliation with the dealerships.These deceptive practices violated Section 5(a) of the FTC Act, 15 U.S.C. § 45, and encompassed forced actions, fake social proof, and hidden costs.",
    "Outcome": "As a case outcome, the Sage Auto Group and its owners are ordered to pay $3.5 million in fines and are prohibited from making misrepresentations related to the sale, financing, or leasing of vehicles, addressing deceptive and unfair sales and financing tactics.",
    "Related deceptive patterns": [
      "Forced action",
      "Fake social proof",
      "Hidden Costs"
    ],
    "Related laws": [
      "Federal Trade Commission Act - Section 5(a), 15 U.S.C. § 45(a)"
    ],
    "title": "Federal Trade Commission v. Universal City Nissan",
    "url": "https://www.deceptive.design/cases/federal-trade-commission-v-universal-city-nissan"
  },
  {
    "Excerpt": "Vonage was held liable by the court for charging customers without their consent, failure to provide required disclosures, and not offering simple mechanisms for customers to cancel their telephone services.",
    "Our analysis": "Vonage is a company that offers phone services to people and businesses using the internet. They automatically renew their services and charge people's credit cards or bank accounts without asking each time. By automatically renewing customers' subscriptions and requiring them to cancel through a live agent during limited working hours, Vonage makes it difficult for customers to cancel their services. They further complicate the process through obscured contact information, circuitous and redundant procedural requirements, long wait times, dropped or unanswered calls, lengthy and repeated sales pitches, and unexpected high-dollar Early Termination Fees (“ETFs”).Vonage's business practices violate laws designed to protect consumers from deceptive and unfair practices. Specifically, their use of deceptive patterns such as hard to cancel, hidden information, and forced continuity, are in violation of Section 5 of the FTC Act, which prohibits unfair or deceptive acts or practices in commerce, as well as the Restore Online Shoppers' Confidence Act (ROSCA), which aims to protect online shoppers from deceptive billing practices. These practices violate ROSCA, which prohibits charging consumers for goods or services sold in transactions effected on the Internet through a negative option feature. Additionally, Vonage does not clearly and conspicuously disclose the existence and amount of Early Termination Fees to business and residential customers enrolling in their services, and they continue to charge customers for recurring service fees even after they have completed the required cancellation procedures. This violates Section 5 of the FTC Act, which requires clear and accurate information to be provided to consumers.",
    "Outcome": "As per the court order agreed upon by Vonage, the company will pay $100 million in refunds to affected consumers, implement a clear and transparent cancellation process, and discontinue charging consumers without their consent.",
    "Related deceptive patterns": [
      "Hard to cancel",
      "Hidden subscription",
      "Sneaking"
    ],
    "Related laws": [
      "Federal Trade Commission Act - Section 5(a), 15 U.S.C. § 45(a)",
      "ROSCA - Section 4, 15 U.S.C. § 8403",
      "ROSCA - Section 4, 15 U.S.C. § 8401",
      "ROSCA - Section 4, 15 U.S.C. § 8402",
      "ROSCA - Section 4, 15 U.S.C. § 8404",
      "ROSCA - Section 4, 15 U.S.C. § 8405"
    ],
    "title": "Federal Trade Commission v. Vonage Holdings Corporation",
    "url": "https://www.deceptive.design/cases/federal-trade-commission-v-vonage-holdings-corporation"
  },
  {
    "Excerpt": "Ed Napleton Automotive Group was held liable for imposing unauthorized \"junk fees\" by sneaking unwanted add-on products.",
    "Our analysis": "North American Automotive Services, Inc. was found liable by the FTC for engaging in deceptive practices at eight of its dealerships, along with the general manager of two Illinois dealerships.-The deception primarily revolved around the improper imposition of \"junk fees\" for unwanted add-on products, including payment insurance and paint protection for its online products, which imposed significant financial burdens on consumers. The dealerships employed a deceitful approach by waiting until the end of lengthy negotiation processes, often involving 60-page contracts, to surreptitiously insert these junk fees into consumers' purchase agreements, even when consumers had explicitly declined these add-ons or had agreed to prices that excluded them.-Additionally, consumers were sometimes misled into believing that these add-ons were either free or mandatory for their vehicle purchase or financing.-The FTC's case against North American Automotive Services, Inc. and the affiliated dealerships primarily hinged on the violation of Section 5(a) of the FTC Act, as specified in 15 U.S.C. § 45(a). The deceptive design employed by the dealerships involved the surreptitious inclusion of junk fees for add-on products in consumers' contracts, a practice commonly referred to as \"sneaking.\"",
    "Outcome": "In accordance with the proposed settlement reached with the Federal Trade Commission (FTC) and the State of Illinois, a $10 million judgment has been rendered. Of this amount, $9.95 million is designated for providing monetary relief to affected consumers, while an additional $50,000 will be allocated to the Illinois Attorney General Court Ordered and Voluntary Compliance Payment Projects Fund. Furthermore, the settlement mandates the defendants to institute a comprehensive fair lending program. This program encompasses various elements, including a restriction on the additional interest markup that can be imposed on consumers. Additionally, the settlement compels the defendants to charge consumers only with explicit and informed consent, while prohibiting any misrepresentation of the costs or terms associated with purchasing, leasing, or financing a vehicle, as well as the optional nature of any fees or charges.",
    "Related deceptive patterns": [
      "Sneaking"
    ],
    "Related laws": [
      "Federal Trade Commission Act - Section 5(a), 15 U.S.C. § 45(a)"
    ],
    "title": "FTC and The State of Illinois v. North American Automotive Services, Inc., et al",
    "url": "https://www.deceptive.design/cases/ftc-and-the-state-of-illinois-v-north-american-automotive-services-inc-et-al"
  },
  {
    "Excerpt": "FTC enforcement action against Amazon relating to Amazon Prime subscription, including explicit mappings in the complaint to five types of \"dark patterns\"",
    "Our analysis": "-The FTC lodged a complaint against Amazon, alleging the company's engagement in \"dark patterns.\" These deceptive patterns included various methods aimed at misleading and coercing consumers into enrolling in Amazon Prime subscriptions that would automatically renew, while also deliberately obstructing the process of canceling these subscriptions.-FTC explicitly maps the types of deceptive patterns used as follows: Amazon was accused of \"Non-consensual Enrollment,\" where it allegedly duped customers into unknowingly signing up for automatic Prime subscription renewals without obtaining their informed consent. Amazon implemented a \"Forced Action\" strategy, compelling customers to make an enrollment decision before they could complete their purchases.- The company used \"Interface Interference\" by manipulating the user interface to prioritize certain information, such as presenting Prime's terms and conditions in a small font and emphasizing \"free shipping\" to divert attention from the subscription's price.-Amazon also employed the \"Obstruction or 'Roach Motel' Technique\" by complicating the subscription cancellation process, making it challenging to find the option to decline enrollment. Amazon asymmetrically presented choices by misdirecting and making it easier to enroll in Prime, using less prominent links to decline Prime, and directing attention away from the cancellation option.- Amazon engaged in \"Sneaking\" by hiding or delaying the disclosure of pertinent information, including Prime's price and auto-renewal feature, during the enrollment checkout process.-FTC alleged that Amazon used \"Confirmshaming,\" involving emotive language to guilt users into selecting the favored option.These deceptive practices were found to be in violation of Section 5(a) of the FTC Act (15 U.S.C. § 45(a)) and Section 4 of the Restore Online Shoppers' Confidence Act (ROSCA) (15 U.S.C. § 8403). Amazon's actions were alleged to contravene consumer protection laws, as they misled consumers and made it challenging for them to make informed decisions regarding their subscriptions.",
    "Outcome": "Pending - Last Update (September 20, 2023)",
    "Related deceptive patterns": [
      "Forced action",
      "Visual interference",
      "Obstruction",
      "Sneaking",
      "Confirmshaming"
    ],
    "Related laws": [
      "Federal Trade Commission Act - Section 5(a), 15 U.S.C. § 45(a)",
      "ROSCA - Section 4, 15 U.S.C. § 8403"
    ],
    "title": "FTC v. Amazon.com, Inc.",
    "url": "https://www.deceptive.design/cases/ftc-v-amazon-com-inc"
  },
  {
    "Excerpt": "Progressive Leasing was held liable for misleading consumers to pay more than the sticker price for items by hiding the cost behind a non-descript dropdown arrow",
    "Our analysis": "Online consumers, seeking items like furniture, jewelry, or cellphones, were often presented with Progressive's payment plans as \"same as cash\" or \"no interest,\" leading them to believe they would not incur charges beyond the item's sticker price. Contrary to these representations, consumers ended up paying more than the sticker price and often approximately twice the sticker price if they adhered to the payment schedule.- The case highlights that consumers were initially shown the \"cash price\" of the item and the costs of their initial and periodic payments, but the full cost of Progressive's payment plan was hidden behind a non-descript dropdown arrow labeled \"Additional Lease Details.\" These deceptive practices, where the true cost of the payment plan was not readily disclosed, violated Section 5 of the FTC Act, 15 U.S.C. § 45, in the marketing, offering for sale, or sale of Rent-to-Own products.",
    "Outcome": "Progressive Leasing has been ordered to pay $175 million in fines. The order mandates that Progressive Leasing refrain from misrepresenting or assisting others in misrepresenting various aspects related to costs, fees, charges, interest, nature of goods or services, availability of options, and other material facts. Additionally, they are required to clearly and conspicuously disclose crucial information about any option to own, rent, lease, or finance, including steps for consumers to exercise the option and the total cost of ownership where applicable.",
    "Related deceptive patterns": [
      "Hidden Costs"
    ],
    "Related laws": [
      "Federal Trade Commission Act - Section 5(a), 15 U.S.C. § 45(a)"
    ],
    "title": "FTC v. Prog Leasing",
    "url": "https://www.deceptive.design/cases/ftc-v-prog-leasing"
  },
  {
    "Excerpt": "Noom Inc reached a settlement, having been accused of tricking customers into signing up for \"risk-free\" trial periods only to force them into automatic and costly renewals that were difficult to cancel.",
    "Our analysis": "Noom, a popular weight-loss program, highlights several deceptive business practices that have been used to lure customers and keep them locked in costly auto-recurring plans. Noom relied on the forced continuity model which involves offering customers a low-cost or zero-cost trial period that is difficult to cancel and ultimately leads to customers being trapped in expensive, long-term contracts. In addition, Noom uses the hard to cancel pattern, which makes it easy for customers to sign up for the program but extremely difficult to cancel.Noom's business model is built around the use of renewal schemes that offer customers enticing promises of low-cost or zero-cost trial periods. However, these trial periods are designed to be difficult to cancel, and customers often find themselves trapped in costly, long-term contracts that they never intended to enroll in. This is achieved through a combination of misleading advertising and ambiguous terms and conditions that make it difficult for customers to understand the true cost and duration of the program.Noom lures customers into its program is by offering a purportedly \"risk-free\" two-week trial period that is either free or offered at a low cost ranging from $1.00 to $18.37. However, after capturing customers' payment information, Noom immediately activates its auto-renewal program and begins assessing non-refundable membership fees. These fees often start with a lump-sum non-refundable advance payment for as many as six months at a time, costing as much as $199.00. Noom's business practices particularly deceptive as the company fails to obtain explicit consent from customers before enrolling them in the automatic renewal program.",
    "Outcome": "Noom Inc agreed to a $62 million settlement in a lawsuit that alleged tricking customers into signing up for \"risk-free\" trial periods only to force them into automatic, costly renewals that were difficult to cancel. The settlement involves a $56 million cash payment and $6 million in subscription credits to be offered.",
    "Related deceptive patterns": [
      "Hidden subscription",
      "Hard to cancel"
    ],
    "Related laws": [
      "California’s False Advertising Law, CAL. BUS. & PROF CODE § 17500",
      "California Consumers Legal Remedies Act, CAL. CIV. CODE § 1750",
      "Unfair Competition Law, CAL. BUS. & PROF CODE § 17200",
      "New York Consumer Fraud Statute, N.Y. GEN. BUS. LAW § 349"
    ],
    "title": "Geraldine Mahood v. Noom, Inc.",
    "url": "https://www.deceptive.design/cases/geraldine-mahood-v-noom-inc"
  },
  {
    "Excerpt": "Emailmovers Limited's privacy policy was not specific enough and did not clearly name third-party recipients. Deploying the deceptive pattern of hidden and misleading information, the company's email data and marketing service were found to have no clear lawful basis for possessing individuals' personal data, violating the principles of lawfulness, fairness, and transparency.",
    "Our analysis": "The ICO (Information Commissioner's Office) found that the privacy policy of the organisation that collected the personal data was not specific enough. While the policy stated that an individual's personal data would be shared with third parties for marketing purposes, it did not clearly name the third party recipients. This lack of specificity can lead to confusion and concern among individuals whose personal data is being shared which can be classified into the deceptive pattern of hidden and misleading information. The ICO emphasised the importance of clear and transparent communication when it comes to the handling of personal data, and recommended that the organisation update their a policy accordingly. It is essential for organisations to be clear about how they collect, use, and share personal data to foster trust and maintain their reputation.The ICO emphasises the requirements for consent, which must be “specific and informed”. It clarifies that consent for purchased “consented” data is valid only if the purchaser is identified at the time the data is collected (i.e., when consent is given). Therefore, EML could not have lawfully purchased the data based on valid consent, as it was not identified as a potential buyer to individuals. The use of these deceptive patterns meant that individuals were not fully aware of the nature of the data collection and how their personal data would be used for marketing purposes. This violated several provisions of data protection regulations, including Article 5(1)(a) of the GDPR, which requires that personal data shall be processed lawfully, fairly and transparently.",
    "Outcome": "Emailmovers Limited must comply with ICO's requirements within three months, which include notifying individuals about the processing of their personal data, ceasing the processing of data for those who were not informed, and keeping appropriate records of consent. Failure to comply may result in a penalty of up to £17.5 million or 4% of the annual worldwide turnover.",
    "Related deceptive patterns": [
      "Sneaking"
    ],
    "Related laws": [
      "GDPR - Article 04(11)",
      "GDPR - Article 05"
    ],
    "title": "ICO v. Emailmovers Limited",
    "url": "https://www.deceptive.design/cases/ico-v-emailmovers-limited"
  },
  {
    "Excerpt": "Vermont held AdoreMe liable for hidden subscriptions, misrepresenting time-limited discounts, and obstructing subscription cancellations.",
    "Our analysis": "Vermont has reached a settlement with lingerie retailer 'Adore Me' concerning allegations of deceptive advertising and billing practices. Adore Me offered consumers discounted pricing as part of its VIP Membership Program, which charged consumers $39.95 per month unless they made a purchase or chose to \"skip\" the charge by the sixth day of each month. The monthly charges accumulated as store credits for future use.- The Attorney General contended that Adore Me failed to provide clear disclosures about the program's terms and the monthly charge, misrepresented time-limited discounts, made it challenging for consumers to cancel their VIP Memberships, and, when canceled, wrongfully refused to refund unspent credits to members. These practices were found to violate the Restore Online Shoppers’ Confidence Act (“ROSCA”), 15 U.S.C. § 8403, as they involved deceptive design patterns of, hidden subscriptions, the creation of fake urgency, and difficulties in the cancellation process.",
    "Outcome": "Adore Me reached a $2.35 million multistate settlement, with the State of Vermont set to receive approximately $34,000, and program members to be notified about refund options for unused credits in their accounts. As part of the settlement, Adore Me committed to implementing clearer offer terms and facilitating hassle-free account cancellations for consumers. Additionally, they will notify all active VIP Memberships about the opportunity to obtain refunds for any remaining store credits.",
    "Related deceptive patterns": [
      "Hidden subscription",
      "Fake urgency",
      "Hard to cancel"
    ],
    "Related laws": [
      "ROSCA - Section 4, 15 U.S.C. § 8403"
    ],
    "title": "In the Matter of AdoreMe Inc.",
    "url": "https://www.deceptive.design/cases/in-the-matter-of-adoreme-inc"
  },
  {
    "Excerpt": "Credit Karma was fined for using false \"pre-approved\" claims, to entice consumers into applying for credit card offers they often did not qualify for.",
    "Our analysis": "The Federal Trade Commission took action against the credit services company for employing dark patterns to falsely represent that consumers were \"pre-approved\" for credit card offers online.-Credit Karma used enticing claims of being \"pre-approved\" and having \"90% odds\" to encourage consumers to apply for offers, even though many of them ultimately did not meet the qualifications. In reality, a substantial number of consumers who received and applied for these \"pre-approved\" offers were subsequently denied approval after undergoing the financial product companies' underwriting review process.-Furthermore, a significant portion of applicants were denied approval due to disqualifying financial and credit characteristics, such as insufficient credit histories, account charge-offs, and bankruptcies. These deceptive practices led to violations of Section 5(a) of the FTC Act, 15 U.S.C. § 45(a).",
    "Outcome": "Credit Karma is ordered to cease making misleading or unsubstantiated claims about approval, including pre-approval, and consumers' likelihood of approval. The company is also mandated to pay $3 million in monetary relief to consumers who applied for the offers mentioned in the complaint. Additionally, to deter future deceptive practices, Credit Karma must retain records of market research, behavioral studies, psychological research, user testing, customer feedback, and usability testing, including any A/B testing.",
    "Related deceptive patterns": [
      "Trick wording"
    ],
    "Related laws": [
      "Federal Trade Commission Act - Section 5(a), 15 U.S.C. § 45(a)"
    ],
    "title": "In the Matter of Credit Karma",
    "url": "https://www.deceptive.design/cases/in-the-matter-of-credit-karma"
  },
  {
    "Excerpt": "Epic Games faced a fine from the FTC after allegations that the company employed deceptive techniques to manipulate players into making unintended purchases, while also allowing children to accumulate unauthorized charges without parental consent.",
    "Our analysis": "The Federal Trade Commission (FTC) filed a complaint against Epic Games, accusing the company of violating the Children's Online Privacy Protection Rule (COPPA) and engaging in deceptive practices. Epic Games has made it difficult for users to cancel or request refunds for unauthorized charges, particularly for Battle Passes, Llamas, and Cosmetics in their game Fortnite. Initially, users were not allowed to cancel any charges, but starting from June 2019, Epic introduced a limited-time option to cancel Cosmetics charges, albeit with certain limitations. However, users have complained that Epic employs design tactics, known as \"dark patterns,\" to discourage cancellations and refunds by obscuring the option or making it hard to find. Furthermore, Epic intentionally created a complex and lengthy refund request process, hiding the link under the \"Settings\" tab and requiring users to navigate unnecessary steps such as providing a reason and confirming their intent to request a refund. These practices have raised concerns about Epic's approach towards customer refunds and their transparency in addressing unauthorized charges.",
    "Outcome": "As part of the settlement, Epic Games agreed to pay a $245 million fine, which will be used to refund affected consumers. The company is now prohibited from using dark patterns or charging consumers without their explicit consent. Epic Games is also barred from blocking access to purchased content when unauthorized charges are disputed.",
    "Related deceptive patterns": [
      "Hard to cancel",
      "Forced action",
      "Obstruction"
    ],
    "Related laws": [
      "Children’s Online Privacy Protection Act Rule"
    ],
    "title": "In the Matter of Epic Games, Inc",
    "url": "https://www.deceptive.design/cases/in-the-matter-of-epic-games-inc"
  },
  {
    "Excerpt": "HomeAdvisor was fined for misleading users about the cost of an optional one-month subscription and making false representations about its services.",
    "Our analysis": "HomeAdvisor's actions centered on deceptive representations made through its sales agents and marketing materials.- HomeAdvisor falsely portrayed the quality, characteristics, and source of the leads it provided to its online service providers*.* HomeAdvisor claimed that these leads were from individuals actively seeking to hire service providers soon, though many of them were not.- HomeAdvisor asserted that**service providers would only receive leads matching their services and geographical preferences, despite many instances where this was not the case.-HomeAdvisor's representation that leads came from individuals knowingly seeking assistance in selecting service providers was contradicted by the fact that many leads were obtained from third-party sources without disclosing their affiliation with HomeAdvisor.- HomeAdvisor's sales agents misled**service providers regarding the cost of an optional one-month subscription to mHelpDesk, a field service software. HomeAdvisor falsely represented that the first month of this subscription was free with an annual membership, when in reality, it increased the annual membership cost by $59.99.These deceptive practices of HomeAdvisor, constitute violations of Section 5(a) of the Federal Trade Commission Act, which prohibits unfair or deceptive acts or practices in commerce. The deceptive designs employed by HomeAdvisor in this context involved concealing costs and misleading service providers about the nature and quality of the leads they were purchasing.",
    "Outcome": "A consent order mandated that the company refrain from making misleading or unsubstantiated representations about its products or services, specifically prohibiting the false representation of a product or service as free when it is not or when it impacts the price of another product or service. Additionally, the order required the company not to misrepresent any other material facts related to the content or key features of their Leads, and imposed a fine of $7.2 million.",
    "Related deceptive patterns": [
      "Sneaking",
      "Hidden Costs"
    ],
    "Related laws": [
      "Federal Trade Commission Act - Section 5(a), 15 U.S.C. § 45(a)"
    ],
    "title": "In the Matter of HomeAdvisor, Inc.",
    "url": "https://www.deceptive.design/cases/in-the-matter-of-homeadvisor-inc"
  },
  {
    "Excerpt": "LendEDU was fined for promoting products in exchange for a fee and posting fake positive reviews on its website.",
    "Our analysis": "The Federal Trade Commission (FTC) finalized a settlement with the Delaware-based comparison shopping website, LendEDU, over allegations that it engaged in deceptive actions.-LendEDU was accused of promoting deceptive rankings of financial products in exchange for a fee and posting fake positive reviews on its website. The agency's administrative complaint revealed that LendEDU created a false impression of providing objective product information while actually offering higher rankings and ratings to companies that paid for placement.-The FTC further alleged that LendEDU falsely claimed that compensation from advertisers did not affect the information on its website, and it touted fake positive reviews.These actions were in violation of the Federal Trade Commission Act, 15 U.S.C. § 45, and constituted deceptive practices, particularly the use of fake social proof.",
    "Outcome": "In the case outcome, the final order resolving the FTC's charges mandates that LendEDU and its operators are prohibited from misrepresenting the objectivity of product rankings, the impact of compensation on content, and material connections or endorsements with companies. Additionally, LendEDU is obligated to pay a fine of $350,000.",
    "Related deceptive patterns": [
      "Fake social proof"
    ],
    "Related laws": [
      "Federal Trade Commission Act - Section 5(a), 15 U.S.C. § 45(a)"
    ],
    "title": "In the Matter of LendEDU",
    "url": "https://www.deceptive.design/cases/in-the-matter-of-lendedu"
  },
  {
    "Excerpt": "TikTok was held liable for nudging children towards privacy-intrusive settings using bold text in two pop-up notifications, hindering neutral and objective choices.",
    "Our analysis": "TikTok was found liable for its processing of children's data, particularly in the implementation of dark patterns violating the fairness principle outlined in Article 5(1)(a) of the GDPR.-The default setting for all new TikTok accounts, including those belonging to children, was public, and-Child Users were prompted with a pop-up notification to 'Go Private' or 'Skip.' This notification failed to present a neutral and objective choice to users.-The DPC observed that TikTok employed dark patterns such as Preselection, Visual Interference, and Forced Action.-The Registration Pop-Up encouraged opting for a public account by emphasizing the \"Skip\" option, while- the Video Posting Pop-Up nudged users to select \"Post Now\" in bold, darker text, making it less apparent and accessible for users to choose privacy settings. The lack of clarity regarding the consequences of different choices further contributed to the infringement of the fairness principle under the GDPR.",
    "Outcome": "The Data Protection Commission found TikTok guilty of violating various GDPR articles and has taken corrective measures. TikTok received a reprimand and must bring its data processing in line with regulations within three months. The DPC has also imposed a total of €345 million in fines for the breaches.",
    "Related deceptive patterns": [
      "Preselection",
      "Visual interference",
      "Forced action"
    ],
    "Related laws": [
      "GDPR - Article 05"
    ],
    "title": "In the matter of TikTok Technology Limited",
    "url": "https://www.deceptive.design/cases/in-the-matter-of-tiktok-technology-limited"
  },
  {
    "Excerpt": "UrthBox engaged in offering a supposedly \"free\" trial without adequately disclosing hidden subscription charges and misrepresenting consumer reviews as independent.",
    "Our analysis": "Between October 2016 and November 2017, the UrthBox offered a seemingly \"free\" trial of its snack boxes online for a nominal shipping fee, failing to adequately disclose key terms on its desktop and mobile websites.-Unbeknownst to consumers, UrthBox would charge them the total amount for six months of shipments if they failed to cancel in time.-Furthermore, UrthBox engaged in deceptive practices by misrepresenting positive consumer reviews on platforms like the Better Business Bureau and third-party websites as independent experiences or impartial opinions, even though the reviewers were compensated with free snack boxes in exchange for posting favorable reviews.These deceptive actions not only violated the FTC Act but also employed deceptive design elements, such as fake social proof and hidden subscription terms, to mislead consumers.",
    "Outcome": "UrthBox is prohibited from engaging in similar conduct and is obliged to pay $100,000 to the FTC. Furthermore, in December 2019, the FTC refunded over $84,000 to compensate consumers who were charged after signing up for the trial offer.",
    "Related deceptive patterns": [
      "Fake social proof",
      "Hidden subscription"
    ],
    "Related laws": [
      "Federal Trade Commission Act - Section 5(a), 15 U.S.C. § 45(a)",
      "ROSCA - Section 4, 15 U.S.C. § 8403"
    ],
    "title": "In the Matter of UrthBox, Inc.",
    "url": "https://www.deceptive.design/cases/in-the-matter-of-urthbox-inc"
  },
  {
    "Excerpt": "The Belgian Data Protection Authority (APD/GBA) imposed a fine on the defendant for placing cookies without prior consent and obtained consent via pre-ticked boxes. Additionally, their policies lacked transparent information on data subject's rights, their exercise, and legal basis for processing.",
    "Our analysis": "In June 2019, the ADP/GBA investigated a company's webpage for potential violations of GDPR articles 6(1)(a), 12, and 13. The GBA submitted a report detailing several violations, including non-compliance with the GDPR and the national law implementing the ePrivacy Directive in the company's privacy statement and cookie policy. The policies did not provide transparent information on the data subject's rights and their exercise, which was a violation of Article 12 GDPR. Additionally, the company did not provide information on the legal basis for processing, data subject's rights, or retention period, which was in breach of Article 13 GDPR. Moreover, the company did not obtain consent for the use of cookies, and pre-ticked boxes were used to obtain consent for the installation of cookies. This practice was contrary to the national law implementing the ePrivacy Directive and Articles 6(1)(a) and 7 GDPR in light of Article 4(11) and Recital 32 GDPR. The company used deceptive patterns like preselection, forced action, and hidden information to obtain user consent, which violated GDPR laws.",
    "Outcome": "The company was found to have violated national laws implementing the ePrivacy Directive and the GDPR by the Belgian Data Protection Authority (GBA). The GBA issued a decision confirming the violations mentioned and imposed a fine of €15,000 as a consequence.",
    "Related deceptive patterns": [
      "Preselection",
      "Forced action",
      "Sneaking"
    ],
    "Related laws": [
      "GDPR - Article 04(11)",
      "GDPR - Article 06",
      "GDPR - Article 07",
      "GDPR - Article 12",
      "GDPR - Article 13"
    ],
    "title": "Inspection by GBA - X - 'Y' website",
    "url": "https://www.deceptive.design/cases/inspection-by-gba-x-y-website"
  },
  {
    "Excerpt": "The Irish DPC held WhatsApp liable for failure to provide non-users with the necessary information and making it difficult to access by excessively spreading it out across several documents.",
    "Our analysis": "WhatsApp came under investigation by the DPC in December 2018 after several individuals lodged complaints about its data processing activities. The DPC's investigation revealed that WhatsApp had violated several laws regarding data protection transparency. Firstly, WhatsApp failed to provide non-users with the necessary information prescribed by Article 14 GDPR, which denied them their right to exercise control over their personal data. This violation involved the use of hidden information, as WhatsApp did not disclose the necessary details to non-users.Secondly, WhatsApp violated Article 13 GDPR by not providing users with sufficiently meaningful information regarding every category of information. This violation involved obstruction, as the information provided by WhatsApp was difficult to access, excessively spread out across several documents, and contained overlapping but slightly different information. The DPC determined that WhatsApp did not comply with its transparency obligations under the GDPR, which resulted in users being unable to adequately consider and exercise their data rights.Moreover, WhatsApp did not identify the legal basis for each processing activity, as required by Article 13(1)(c) of the GDPR. Additionally, with respect to transfers of personal data to non-EEA jurisdictions, the DPC found that WhatsApp's statement that transfers \"may\" rely on adequacy determinations was insufficient to comply with Article 13(1)(f) of the GDPR. WhatsApp should have definitively identified whether or not an adequacy decision existed to support the transfer of specific categories of data.",
    "Outcome": "The DPC utilized various corrective measures to address the violations committed by WhatsApp. These included a reprimand under Article 58(2)(b), an order to bring processing operations into compliance within three months under Article 58(2)(d), and an administrative fine of €225,000,000 under Articles 58(2)(i) and 83. The fine was broken down into four separate fines for each violation committed by WhatsApp. The first violation, which was the infringement of Article 5(1)(a) of the GDPR, resulted in a fine of €90,000,000. The second violation, which was the infringement of Article 12 of the GDPR, resulted in a fine of €30,000,000. The third violation, which was the infringement of Article 13 of the GDPR, resulted in a fine of €30,000,000. The fourth violation, which was the infringement of Article 14 of the GDPR, resulted in a fine of €75,000,000. Overall, the DPC utilized a range of corrective measures to ensure that WhatsApp complied with the GDPR and imposed significant fines to address the various violations committed by the company.",
    "Related deceptive patterns": [
      "Obstruction",
      "Sneaking"
    ],
    "Related laws": [
      "GDPR - Article 05",
      "GDPR - Article 12",
      "GDPR - Article 13",
      "GDPR - Article 14",
      "GDPR - Article 58"
    ],
    "title": "Ireland's Data Protection Commission Investigation into WhatsApp Ireland Limited",
    "url": "https://www.deceptive.design/cases/ireland-s-data-protection-commission-investigation-into-whatsapp-ireland-limited"
  },
  {
    "Excerpt": "The Irish DPC has issued a draft decision against Yahoo for using cookie banner that lacks an option for users to deny ad tracking by not offering the required free choice.",
    "Our analysis": "Yahoo is the owner of various media properties, such as Yahoo News, Yahoo Finance, and Yahoo Sports, as well as tech media sites like Engadget, HuffPo, and Tumblr. These sites are linked to the company's online advertising business through the use of tracking cookies, which trigger cookie consent banners displaying information about ad partners and data processing purposes. However, under the GDPR, valid consent for data processing must be informed, specific, and freely given.The investigation conducted by the Data Protection Commission (DPC) focused on transparency issues related to publications operated by Yahoo, following multiple complaints from individuals about Yahoo media sites. One of the main concerns raised was the cookie banners used on these sites, which were reported to sometimes \"effectively\" offer no choice to users beyond an \"okay\" button. This issue is particularly relevant given that the GDPR requires consent for data processing to be freely given and specific, meaning that users must have a genuine choice to accept or reject tracking.Moreover, the current cookie banner implementation by Yahoo places the reject button on the second level of the menu, rather than alongside the \"accept all\" option at the top. This means that users must first click through \"manage settings\" before they can see the option to reject all cookies. Furthermore, the second level menu is quite long and requires scrolling, which may make it less user-friendly and raise new regulatory concerns. This revised design may be seen as failing to provide an equally simple way for users to reject tracking, which could result in further complaints and investigations by the DPC.",
    "Outcome": "A preliminary decision has been issued following an assessment of the company's compliance with the GDPR's provisions on transparent information provision to data subjects.",
    "Related deceptive patterns": [
      "Visual interference",
      "Obstruction",
      "Forced action"
    ],
    "Related laws": [
      "GDPR - Article 05",
      "GDPR - Article 12",
      "GDPR - Article 13",
      "GDPR - Article 14"
    ],
    "title": "Ireland's Data Protection Commission Investigation into Yahoo",
    "url": "https://www.deceptive.design/cases/ireland-s-data-protection-commission-investigation-into-yahoo"
  },
  {
    "Excerpt": "Italian DPA found Ediscom guilty of using misleading interfaces and unclear submission procedures, such as prompting users to provide consent for marketing despite already denying it.",
    "Our analysis": "The Italian DPA imposed sanctions on Ediscom for violating multiple provisions of the GDPR, including the accountability principle, conditions for consent, and privacy-by-design and privacy-by-default principles. Ediscom was found to frequently use misleading interfaces and unclear submission procedures. They would prompt users who had already denied consent for marketing communications to provide consent again through deceptive design elements. The link to continue without providing consent was placed outside the pop-up and in a smaller format, making it less visible than the accept button. The Garante also noted that Ediscom employed unclear communication models and registration processes, which violated guidelines on dark patterns. These actions by Ediscom were considered attempts to obtain consent despite the user's clear expression of intent and created confusion, potentially leading to consent given under misleading circumstances. Additionally, Ediscom failed to require email validation for certain services and used specially designed interfaces to collect excess data and bypass the will of the users. The Garante concluded that obtaining consent through such deceptive methods undermined the freedom and awareness of the individuals and was therefore unlawful.",
    "Outcome": "Ediscom claimed good faith and implemented corrective measures, including adapting pop-up graphics, sending confirmation emails, reviewing system mechanisms, renegotiating contracts, and establishing precise checks on acquired databases.",
    "Related deceptive patterns": [
      "Visual interference",
      "Forced action"
    ],
    "Related laws": [
      "GDPR - Article 05",
      "GDPR - Article 07",
      "GDPR - Article 25"
    ],
    "title": "Italian Data Protection Authority Sanctioning Measure against Ediscom SpA",
    "url": "https://www.deceptive.design/cases/italian-data-protection-authority-sanctioning-measure-against-ediscom-spa"
  },
  {
    "Excerpt": "The Belgian DPA fined the IAB Europe as information provided to the data subjects was too generic and incomplete regarding processing of data or their right to object to it.",
    "Our analysis": "The Belgian DPA has found that the Interactive Advertising Bureau Europe (IAB Europe) did not meet its transparency obligations under the GDPR (Articles 12, 13, and 14 of the GDPR). The DPA found that the IAB Europe's Transparency and Consent Framework (TCF)  provided to users was too generic and did not enable them to give specific and informed consent, which is required for consent to be considered valid. Additionally, the large number of adtech vendors that could potentially receive users' personal data further complicated the matter, making it difficult for users to be fully informed and for the IAB Europe to comply with its transparency and information obligations under the GDPR. To address these issues, the DPA has required TCF-registered Consent Management Platforms (CMPs) to take a harmonised and GDPR-compliant approach to providing information to users through their interface. This includes ensuring that any information provided about data processing is precise, concise, and understandable to prevent users from being surprised by subsequent processing of their personal data by parties other than publishers or IAB Europe.",
    "Outcome": "The Interactive Advertising Bureau Europe has been fined €250,000 by the Belgian DPA for several GDPR violations, including not complying with transparency and information obligations and failing to implement appropriate measures to ensure personal data security. Additionally, the company did not keep records of processing activities, conduct a DPIA, or designate a DPO. The DPA has set a deadline of 6 months after the validation of an action plan for the company to implement the necessary measures.",
    "Related deceptive patterns": [
      "Sneaking"
    ],
    "Related laws": [
      "GDPR - Article 12",
      "GDPR - Article 13",
      "GDPR - Article 14"
    ],
    "title": "Johnny Ryan, Pierre Dewitte, Jeff Ausloos, La Ligue des Droits de l'Homme, Bits of Freedom & Katarzyna Szymielewicz v. IAB Europe",
    "url": "https://www.deceptive.design/cases/johnny-ryan-pierre-dewitte-jeff-ausloos-la-ligue-des-droits-de-l-homme-bits-of-freedom-katarzyna-szymielewicz-v-iab-europe"
  },
  {
    "Excerpt": "The Danish DPA expressed criticism against a controller for using multiple layers to collect consent, not providing adequate information and using colors (greyed options) to influence user choice.",
    "Our analysis": "The Danish Data Protection Authority conducted a written inspection into JP/Politiken A/S' processing of personal data about visitors towww.eb.dk. JP/Politiken used a consent solution with three options - Necessary only, Customize Settings, and Accept all. However, visitors who selected Accept all did not receive adequate information about all processing purposes, as the purpose of preferences only appeared in the second layer of the consent solution. This means that visitors did not give informed consent, and the processing of personal data for statistical and marketing purposes contradicted the principle of legality, fairness, and transparency. While visitors could access the second layer of the consent solution by clicking on Customize Settings, the Danish Data Protection Authority found that this did not constitute voluntary consent because visitors did not have a free choice and control over their personal data.As a result, since all requirements under the data protection regulation's Article 4(11) were not met, there was no valid consent to form the basis for processing personal data in accordance with the data protection regulation's Article 6(1)(a). The authority raised concerns that the use of colors in response buttons, especially a traffic light-like system, can influence visitors to make certain choices and constitute a form of nudging that is not compatible with the principle in Article 5(1). While the Authority generally allows design freedom in layout and content, it believes that the use of colors should not lead to opacity or unreasonable processing situations. In the specific case of the consent solution, the use of green for the \"Accept all\" button, according to the Authority, can bypass the data subject's ability to exercise an informed choice.",
    "Outcome": "The DPA found that the controller's website did not obtain informed consent as visitors who clicked on \"Accept all\" did not receive all processing information. The consent did not meet Article 4(11) GDPR, and the controller could not rely on Article 6(1)(a) GDPR. Additionally, using a traffic light-like colour and design scheme in the consent solution constituted a form of \"guiding\" that interfered with the user's ability to make an informed choice. As a result, the DPA reprimanded the controller for the identified violations.",
    "Related deceptive patterns": [
      "Visual interference",
      "Obstruction",
      "Disguised ads",
      "Sneaking"
    ],
    "Related laws": [
      "GDPR - Article 04(11)",
      "GDPR - Article 06",
      "GDPR - Article 05"
    ],
    "title": "JP/Politikens Hus A/S Investigation by Danish DPA",
    "url": "https://www.deceptive.design/cases/jp-politikens-hus-a-s-investigation-by-danish-dpa"
  },
  {
    "Excerpt": "CNIL found Amazon guilty of depositing cookies without prior consent and the failure to inform users about depositing cookie or the means to refuse them.",
    "Our analysis": "The CNIL discovered that Amazon.fr was placing a large number of cookies for advertising purposes on users' computers without their consent when they visited the site. The CNIL deemed this action to be a violation of the obligation to obtain user consent before depositing cookies, as these cookies were not essential to the service. The banner displayed on the Amazon.fr site was also found to be inadequate in informing users residing in France beforehand and clearly about the deposit of cookies, their objectives, and how to refuse them. Moreover, when users visited Amazon.fr after clicking on an advertisement published on another website, the same cookies were deposited without any banner being displayed. The CNIL found that Amazon committed two violations of Article 82 of the Data Protection Act by depositing cookies without prior consent and failing to inform users.",
    "Outcome": "The CNIL has levied a fine of 35 million euros on AMAZON EUROPE CORE. The fine is a result of the company's placement of advertising cookies on the computers of users of the Amazon.fr sales site without obtaining their prior consent or providing sufficient information about the use of cookies.",
    "Related deceptive patterns": [
      "Sneaking",
      "Forced action"
    ],
    "Related laws": [
      "French Data Protection Act - Article 82"
    ],
    "title": "La Quadrature du Net v. Amazon Europe Core",
    "url": "https://www.deceptive.design/cases/la-quadrature-du-net-v-amazon-europe-core"
  },
  {
    "Excerpt": "The New York Times was held liable for failing to clearly disclose automatic subscription renewal terms, leading to unauthorized charges and hidden subscription renewals.",
    "Our analysis": "-Meghan Perkins, initiated a lawsuit against The New York Times, alleging wrongful renewal of her digital subscription without her consent and in violation of North Carolina law. Perkins purchased a monthly digital Times subscription at a promotional rate, providing her PayPal information. The lawsuit contends that The New York Times failed to clearly and conspicuously disclose the automatic renewal terms during the subscription process, leading to Perkins unwittingly enrolling in a program where her subscription renewed each month at varying rates. Approximately a year after her subscription began, Perkins's monthly fee doubled without timely notice. Her subscription was renewed an additional twenty-three times without her consent, resulting in unauthorized charges.-The lawsuit accuses The New York Times of violating all four subsections of the North Carolina Automatic Renewal Statute (N.C.G.S. Section 75-41(a) by inadequately disclosing subscription renewal terms, thus breaching the state's consumer protection laws. The Complaint brings one claim under the North Carolina Automatic Renewal Statute, one claim of unfair and deceptive trade practices under North Carolina law (N.C.G.S. Section 75-16), and one claim of unjust enrichment. The alleged deceptive pattern involves hidden subscriptions, in contravention of North Carolina law.",
    "Outcome": "The motion to dismiss the case by the New York Times Company is denied.",
    "Related deceptive patterns": [
      "Hidden subscription"
    ],
    "Related laws": [
      "North Carolina Automatic Renewal Statute, N.C.G.S. Section 75-41(a)"
    ],
    "title": "Megan Perkins v. The New York Times Company",
    "url": "https://www.deceptive.design/cases/megan-perkins-v-the-new-york-times-company"
  },
  {
    "Excerpt": "The EDPB fined Meta for the providing lack of processing contact information on children’s business accounts and using ‘public by default’-settings for child users.",
    "Our analysis": "The Irish Data Protection Commission (DPC) found that Instagram's default account settings for child users were set to public, meaning that anyone on the app or website, regardless of whether they were registered users or not, could view the contents of the account. This was in violation of Article 12(1) of GDPR because Instagram did not clearly and transparently inform child users of the purpose of public-by-default processing. Although Meta (Instagram's parent company) had informed child users of this setting in their 2018 and 2020 Data Policies, the DPC deemed this insufficient.The European Data Protection Board (EDPB) agreed with the DPC's assessment that the interests pursued by Instagram were not specific enough, as the controller had mentioned them in vague language. The EDPB also criticized the DPC for not conducting a better evaluation of the existence of the legitimate interest(s) pursued by Instagram. Furthermore, Instagram failed to provide child users with information on the purposes of processing and the categories of recipients of personal data using clear and plain language, which was required under Articles 13(1)(c) and (e) of GDPR.",
    "Outcome": "Following the adoption of a binding decision by the European Data Protection Board (EDPB), the Irish Data Protection Commission (DPC) fined Meta €405,000,000 for processing contact information on children's business accounts without legal grounds and for having default settings set to \"public\" for child users.",
    "Related deceptive patterns": [
      "Preselection",
      "Sneaking"
    ],
    "Related laws": [
      "GDPR - Article 05",
      "GDPR - Article 06",
      "GDPR - Article 12",
      "GDPR - Article 24",
      "GDPR - Article 25"
    ],
    "title": "Meta Platforms Ireland Limited, and Instagram Social Media Network's Investigation by DPC",
    "url": "https://www.deceptive.design/cases/meta-platforms-ireland-limited-and-instagram-social-media-network-s-investigation-by-dpc"
  },
  {
    "Excerpt": "Just Landed, a Spanish entity, has been fined by the Spanish DPA for having a privacy policy written only in English and not providing a mechanism to accept, reject or manage cookies.",
    "Our analysis": "The Spanish DPA has fined the entity behind the URL.1 website for violating GDPR and LOPDGDD regulations. The website's privacy policy was written only in English, despite the entity being located in Spanish territory which amounts to language discontinuity. Additionally, the website did not have a banner or notice related to the existence of cookies, and there was no link or mechanism for users to accept, reject or manage cookie installation. Cookies were loaded automatically without any prior action, amounting to forced action. These deceptive patterns violate article 13 of the GDPR, which requires the provision of information to interested parties at the time of data collection.",
    "Outcome": "The outcome is a €3,000 sanction for improper use of data storage and recovery devices without consent. JUST LANDED, SL must include a Spanish \"privacy policy\" and information on cookies, with a mechanism for users to manage preferences. They must also ensure cookies are not installed unnecessarily. Failure to comply may result in a €30,000 fine.",
    "Related deceptive patterns": [
      "Trick wording",
      "Forced action"
    ],
    "Related laws": [
      "GDPR - Article 13",
      "GDPR - Article 58",
      "GDPR - Article 83",
      "Spanish Law on Information Society Services - Article 22"
    ],
    "title": "Mr. A.A.A. (Claimant) v. Just Landed, S.L.",
    "url": "https://www.deceptive.design/cases/mr-a-a-a-claimant-v-just-landed-s-l"
  },
  {
    "Excerpt": "ARANOW PACKAGING MACHINERY, S.L was fined by AEPD for violations related to its Cookie Policy. AEPD conducted an investigation that included an examination of the information provided in the Cookie Policy, including details on the use of cookies and data collected. AEPD also looked for any mechanism to reject all cookies, but found none.",
    "Our analysis": "A complaint was filed against the website ***URL.1 for not complying with data protection regulations, specifically for not having a Privacy Policy, a contact page, and a Cookie Policy in accordance with the current legislation. After examining the Privacy and Cookie policies, the AEPD found that the Privacy policy complied with Article 13 GDPR but the Cookie policy did not align with Article 22.2 LSSI. The website lacked a mechanism to reject all cookies, and there was no link to different browsers to deactivate or delete cookies, which was deemed contrary to legal provisions. Forced action deceptive design was used in this case by not providing users with an option to reject all cookies, which would require them to actively take steps to disable cookies individually in their browser settings. This design effectively forces users to accept cookies as the default option, even if they may not want them. This violates the principle of informed consent, as users are not provided with a genuine choice over whether or not to accept cookies.",
    "Outcome": "ARANOW PACKAGING MACHINERY, S.L was fined by AEPD for violating the rights of service recipients by using cookies without providing necessary information as per Article 22.2 of the LSSI. The company was fined EUR 3000 but used two attenuating factors from the LPACAP to reduce the penalty, resulting in a reduced fine of EUR 1800.",
    "Related deceptive patterns": [
      "Forced action"
    ],
    "Related laws": [
      "GDPR - Article 13",
      "Spanish Law on Information Society Services - Article 22"
    ],
    "title": "Mr. A.A.A. v. Aranow Packaging Machinery",
    "url": "https://www.deceptive.design/cases/mr-a-a-a-v-aranow-packaging-machinery"
  },
  {
    "Excerpt": "The Spanish DPA imposed a fine on the owner of a commercial website for processing personal data without proper consent, using unnecessary third-party cookies that could not be rejected, and failing to provide clear information about the cookies in use in the Cookies policy.",
    "Our analysis": "Ms. A.A.A., the owner of a commercial website, was the subject of a complaint lodged by a data subject, Mr. B.B.B., who claimed that the website failed to comply with GDPR Article 6 and Article 13, along with Spanish national law Article 22.2 LSSI. The data subject highlighted three issues with the controller's website: the contact form, the Privacy Policy, and the Cookie Policy. Firstly, the contact form on the website did not provide the data subject with the option to consent to the processing of their personal data, including their name and email address. Secondly, the website's Privacy Policy failed to disclose all relevant information as required by GDPR Article 13, thus the controller did not fulfil their obligation to inform. This deceptive pattern of hidden information was seen as a lack of consent violating GDPR Article 6. Thirdly, the use of third-party cookies on the website was neither necessary nor functional, and the user was unable to reject these cookies, amounting to forced action.Additionally, Google cookies were already in use even before the data subject actively and expressly gave their consent or took action on the website. The Cookie Policy did not provide detailed information about the cookies in use, such as the activity time, mission, or precise identification of the cookies. The processing of personal data without the consent of the data subject violated GDPR Article 6. Furthermore, the data subject was not informed about the use of cookies, and the controller did not offer the data subject the opportunity to reject them, thus violating Article 22.2 LSSI. The DPA further explained that the information provided to the user about the use of storage devices and data recovery, as well as the purposes of processing (including cookies), must be disclosed in accordance with GDPR provisions.",
    "Outcome": "The Spanish Data Protection Authority fined a controller €3,000 for processing personal data without consent, violating Article 6 GDPR and Article 13 GDPR for the Privacy Policy. The controller also violated Article 22(2) LSSI by using cookies without consent and failing to provide clear information on data processing purposes. The controller had to adapt the website to comply with GDPR requirements and paid a reduced fine of €1,800.",
    "Related deceptive patterns": [
      "Forced action",
      "Sneaking"
    ],
    "Related laws": [
      "GDPR - Article 06",
      "GDPR - Article 13",
      "Spanish Law on Information Society Services - Article 22"
    ],
    "title": "Mr. B.B.B (Data Subject) v. Ms. A.A.A (Owner of Commercial Website)",
    "url": "https://www.deceptive.design/cases/mr-b-b-b-data-subject-v-ms-a-a-a-owner-of-commercial-website"
  },
  {
    "Excerpt": "The company was held liable for insufficient clarity in information, and the absence of a clear cookie policy or consent for the use of cookies.",
    "Our analysis": "In this case, the data subject lived in social housing provided by the controller and raised multiple issues at different times. These issues included inadequate information provided when exercising the right of access, an insufficiently secure website with a vague privacy policy, no clear cookie policy, and no consent asked for the usage of cookies. The retention period of personal data was also not discussed, and it was unclear why certain personal data of medical nature was required. The DPA upheld that a privacy policy should serve to fully inform the data subject about what is actually done with his or her personal data and in what context those data are processed. Any processing of personal data should be lawful, proper, and transparent. Data subjects should be clearly informed of what data is being processed, how the processing is being carried out, and why the personal data is being processed. However, the Privacy Sheet presented did not adequately inform the data subjects, particularly as they were socially disadvantaged people, and the language used must be clear and plain. The DPO was not properly designated or communicated to the data subject, and the DPO was not involved in all data protection matters, breaching Article 38(1) GDPR. Additionally, no consent was asked for the Google-DoubleClick.net cookie, breaching Article 6(1) GDPR. The processing of personal data through cookies without consent is not legally valid.",
    "Outcome": "The DPA has ordered a private housing company to become compliant with data protection regulations within three months and pay a fine of €1500. The DPA does not consider the housing company to be a \"public authority or public body\" under Article 83(7) of the DPA, which exempts such bodies from administrative fines. This concept is defined by Union law and is subject to an autonomous and uniform interpretation by Union institutions, particularly the Court of Justice.",
    "Related deceptive patterns": [
      "Sneaking",
      "Trick wording",
      "Forced action"
    ],
    "Related laws": [
      "GDPR - Article 05",
      "GDPR - Article 06",
      "GDPR - Article 12",
      "GDPR - Article 13",
      "GDPR - Article 15",
      "GDPR - Article 37",
      "GDPR - Article 38"
    ],
    "title": "Mr X (The complainant) v. Y Housing company (The defendant)",
    "url": "https://www.deceptive.design/cases/mr-x-the-complainant-v-y-housing-company-the-defendant"
  },
  {
    "Excerpt": "The Spanish DPA found an online clothing store responsible for handling personal data without consent from the people involved, not having a privacy policy in place, and using unnecessary cookies without informing users properly through a cookie banner.",
    "Our analysis": "Lia's Clothes, an online clothes store, was found liable for not having an adequate privacy policy or cookie banner. Upon investigation, the Spanish DPA (AEPD) found that personal data was collected without informing the data subjects about the protection of their personal data or providing a link to a privacy policy. Additionally, non-essential cookies were used on the website without providing appropriate information through a banner or giving data subjects the option to reject them. The AEPD held that the online store violated Article 6(1) GDPR by processing personal data without clear, affirmative, informed, and free consent. Furthermore, by not having a privacy policy or disclosing who the controller of the personal data would be, the online store also violated Article 13 GDPR. Lastly, the use of non-essential cookies without a cookie banner violated Article 22.2 of the Spanish Law of Information Society Services (LSSI), which requires clear and complete information on the use of cookies and the option to reject them.",
    "Outcome": "The AEPD fined the owner of an online store €3000 for three violations of data protection laws. The owner voluntarily paid the fine and accepted responsibility, resulting in a reduced fine of €1800. Additionally, the AEPD ordered the owner to add a proper privacy policy and cookie banner to their website to comply with data protection laws.",
    "Related deceptive patterns": [
      "Forced action",
      "Sneaking"
    ],
    "Related laws": [
      "GDPR - Article 06",
      "GDPR - Article 13",
      "Spanish Law on Information Society Services - Article 22"
    ],
    "title": "Mrs. A.A.A., (Lia’s Clothing) and Zulmar Santamaria, S.L.",
    "url": "https://www.deceptive.design/cases/mrs-a-a-a-lia-s-clothing-and-zulmar-santamaria-s-l"
  },
  {
    "Excerpt": "Marbella Resorts was fined by the Spanish DPA for not having a data processing agreement with the processor and for violating the Spanish Law on cookies by placing unnecessary cookies without user consent.",
    "Our analysis": "The complaint was submitted by a data subject to the Spanish DPA (AEPD), stating that their ID card had been found on an adult website, along with their personal information, after being a guest in one of the chain's hotels. The data subject also requested access to their personal data from the hotel, which revealed that an employee of the building's owners association had scanned their ID card since the reception desk was closed. Upon further investigation, the AEPD discovered that Marbella Resorts' website had a cookie banner that did not provide sufficient information about the use of cookies and did not allow users to reject consent for unwanted cookies. Additionally, the hotel chain used unnecessary cookies before obtaining consent, violating Article 22 of the Spanish Law implementing the e-Privacy Directive (LSSI). Furthermore, the AEPD found that Marbella Resorts had violated Article 28(3) of the GDPR, as the hotel chain did not have a data processing agreement with the building's owners association to govern the processing of personal data. The use of deceptive patterns, specifically the lack of transparency in the cookie banner and the placement of unnecessary cookies without clear user consent, was a significant factor in the AEPD's decision to fine Marbella Resorts. The forced action of accepting cookies without sufficient information or the ability to reject unwanted cookies is a clear example of a deceptive pattern, which violates both Article 5(3) of the e-Privacy Directive and Article 22(2) of the Spanish Law on cookies (LSSI). The lack of transparency and user control in cookie consent mechanisms is a significant concern for data protection authorities, as it can lead to the misuse of personal data.",
    "Outcome": "The controller was fined €7,000 by AEPD, which was reduced to €4,200 after early and voluntary payment, for violating Article 28(3) GDPR and Article 22 of the Spanish Law implementing the e-Privacy Directive (LSSI). The infringements included improper information about the use of cookies and placing unnecessary cookies without consent, without the option of individually rejecting them.",
    "Related deceptive patterns": [
      "Forced action"
    ],
    "Related laws": [
      "GDPR - Article 28",
      "Spanish Law on Information Society Services - Article 22"
    ],
    "title": "Ms. A.A.A. (Claimant) v. Marbella Resorts, S.L.",
    "url": "https://www.deceptive.design/cases/ms-a-a-a-claimant-v-marbella-resorts-s-l"
  },
  {
    "Excerpt": "The Italian DPA fined Douglas for providing a single button to accept the general terms and conditions, privacy policy and cookie policy. Additionally, there was no information about data processing in its privacy policy.",
    "Our analysis": "The DPA launched an investigation into the controller's data collection practices, specifically focused on its app and privacy policy. During the investigation, the DPA conducted tests on the controller's app and found several deceptive patterns used during the registration process. The user was presented with a single button to accept multiple policies. The bundling of choices was seen as a single button was used to accept the general terms and conditions, privacy policy, and cookie policy.Furthermore, when creating an account on the app, the user was asked to provide an email address and date of birth. However, the information provided to customers regarding the purposes of processing and the legal basis was incomplete and inadequate. The deceptive pattern of hidden information is seen here as the privacy policy informed interested parties that their data would be processed for a variety of purposes based on consent, but failed to provide any information on how data collected separately by the three companies was processed after the merger.The DPA found that the controller violated Article 13(2)(a) GDPR by failing to provide complete information about the processing of personal data acquired through the merger. Additionally, the controller violated Article 5(2), Article 24, and Article 13 GDPR by not providing evidence of the purposes and criteria for the storage of personal data processed through the blog and for the blog's lack of privacy notice. Article 5(2) GDPR requires that personal data be collected for specified, explicit, and legitimate purposes and not further processed in a manner that is incompatible with those purposes. Article 24 GDPR mandates that controllers implement appropriate technical and organizational measures to ensure and demonstrate that processing is performed in accordance with the GDPR. Finally, Article 13 GDPR requires that controllers provide clear and concise information to data subjects about the processing of their personal data.",
    "Outcome": "The controller faced corrective measures from the DPA under Article 58(2) GDPR to align its processing activities with GDPR regulations. The measures included revising the privacy and cookie policy, disposing of personal data older than 10 years (excluding ongoing disputes), and deleting or making anonymous recently collected personal data. The controller was also required to implement organizational and technical measures to ensure the proper handling of customer data in line with principles of purpose, storage limitation, and data minimization. In addition to these measures, the DPA imposed a fine of €1,400,000 on the controller for breaching multiple GDPR provisions.",
    "Related deceptive patterns": [
      "Sneaking",
      "Forced action"
    ],
    "Related laws": [
      "GDPR - Article 05",
      "GDPR - Article 06",
      "GDPR - Article 07",
      "GDPR - Article 12",
      "GDPR - Article 13",
      "GDPR - Article 24",
      "GDPR - Article 25"
    ],
    "title": "Ms XX (Complainant) v. Douglas Italia S.p.a.",
    "url": "https://www.deceptive.design/cases/ms-xx-complainant-v-douglas-italia-s-p-a"
  },
  {
    "Excerpt": "Nintendo faces a class action lawsuit over allegedly compelling players to make in-game purchases by creating hurdles for non-buyers and employing fake limited-time offers.",
    "Our analysis": "-Nintendo is facing a class action lawsuit filed by a minor gamer, with claims that their mobile game, Mario Kart Tour, employed \"dark patterns\" to encourage players to engage in \"immoral\" microtransactions. Players could spend real money on \"Spotlight Pipes,\" which contained undisclosed odds for in-game rewards.-The lawsuit asserts that Nintendo intentionally designed the game to make it challenging for players who didn't spend money, employing tactics like \"dark patterns.\" These dark patterns included mechanisms such as \"Grinding,\" where players had to engage in repetitive tasks to achieve in-game benefits. To make the game more enticing, they also implemented the \"Pay to Skip\" mechanism, allowing players to pay real-world currency to bypass grind-related activities. This often involved using premium in-game currency like Rubies. The game employed the dark pattern of artificial scarcity, creating a sense of urgency through limited-time deals. This pressured users into making impulsive choices and prevented them from considering the relative value of different in-game options.The lawsuit claims that these practices violated Washington State's Consumer Protection Act and California business law. Moreover, it alleges that Nintendo's use of a \"loot box mechanism\" in the game \"capitalized on and encouraged addictive behaviors,\" which is particularly concerning for younger players who may be more vulnerable to such systems.",
    "Outcome": "Pending. Last Update - Removed from the Superior Court of the State of California for the County of Contra Costa; Case Currently Placed on Federal Docket for Legal Action",
    "Related deceptive patterns": [
      "Forced action",
      "Fake urgency"
    ],
    "Related laws": [
      "Washington Consumer Protection Act - Wash. Rev. Code §§ 19.86.010",
      "Unfair Competition Law, CAL. BUS. & PROF CODE § 17200"
    ],
    "title": "N.A. (through his guardian) v. Nintendo of America",
    "url": "https://www.deceptive.design/cases/n-a-through-his-guardian-v-nintendo-of-america"
  },
  {
    "Excerpt": "The news service was fined by the Hungarian DPA where the controller's newsletter subscribers were automatically enrolled in electronic marketing and a prize draw without adequate information or the ability to provide specific consent.",
    "Our analysis": "A news service provider was fined for violating GDPR regulations by the Hungarian DPA. The provider's newsletter subscribers were automatically signed up for electronic direct marketing (eDM) and a prize draw without being informed and without the option to opt out. The provider relied on Article 6(1)(b) GDPR to process subscriber data for the newsletter, but they also processed personal data for eDM and the prize draw. The DPA found that the provider's conduct breached GDPR regulations in several ways, including not informing data subjects about their rights, not adequately informing them about the duration of data processing, and not fulfilling the conditions for consent according to Article 7 GDPR.During the investigation, the DPA found that between January 1st, 2021 and May 17th, 2022, all subscribers who registered online for the news service were automatically subscribed to eDM, making it impossible to subscribe to the service without also subscribing to eDM. The provider argued that the data processing was legitimate based on their legitimate interests, but the DPA rejected this argument. The absence of information regarding the legal basis and the data subject's rights generally constitutes unfair processing. The DPA also found that the data processing was not based on consent because it did not meet the criteria set out in Article 7 GDPR, such as granular consent and providing necessary information to data subjects.",
    "Outcome": "DPA deemed the data processing to be illegal due to violations of Article 7(2), Article 7(4), and Article 6(1)(a) of the GDPR, resulting in a fine of 2,000,000 HUF (approximately €5,080). The DPA considered several factors in determining the fine, including the controller's cooperation during the proceedings, admission of the infringement, implementation of remedial actions for the future, and internal training. Additionally, the infringement was limited to the email addresses of data subjects and did not include any sensitive data. However, the extended period of the data processing was seen as an aggravating circumstance.",
    "Related deceptive patterns": [
      "Forced action"
    ],
    "Related laws": [
      "GDPR - Article 06",
      "GDPR - Article 07",
      "GDPR - Article 12"
    ],
    "title": "National Data Protection and Freedom of Information Authority v. Anonymous News Service Provider",
    "url": "https://www.deceptive.design/cases/national-data-protection-and-freedom-of-information-authority-v-anonymous-news-service-provider"
  },
  {
    "Excerpt": "CNIL found Google liable for providing information in a fragmented and generic manner, and for using pre-ticked boxes for personalization settings of the account.",
    "Our analysis": "According to the CNIL's findings, Google has scattered information related to data processing operations across several documents, some of which are not easily accessible. Furthermore, Google has designed its interfaces in such a way that the information is fragmented and requires users to click on buttons and links to access relevant information. The CNIL has noted that the amount of information that users must read before they can identify the data processing operations is too large. This makes it difficult for users to understand what data processing operations are being carried out and what the scope and consequences of those operations are.The information provided by Google to users is not easily accessible or comprehensible, which violates Article 12 of the GDPR. The CNIL has also noted that while providing exhaustive information from the first level might not be practical, the information provided should still be clear and comprehensible. In particular, the CNIL has found that the purposes of the processing operations are described in a way that is far too generic given the scope and consequences of the processing operations carried out. Additionally, the description of the purposes does not allow users to measure the extent of the processing and the degree of intrusion into their private sphere. The description of the data collected is also found to be imprecise and incomplete, which violates Article 13 of the GDPR.Google's formulations do not distinguish between personalized advertising and other forms of targeting, and the personalization settings of the account are pre-ticked by default, which translates to the user's agreement to the processing of their data. This violates Article 4(11), Article 6(1)(a), Article 7, Article 12, and Article 13 of the GDPR, which require that information provided to users must be clear and comprehensible, and that users must give their explicit and informed consent to the processing of their data.",
    "Outcome": "The CNIL concluded that the way consent was obtained by a company was not valid due to the absence of a positive action and the use of an opt-out mechanism. Additionally, the CNIL found that the company's terms and conditions did not allow for specific consent and prevented users from making a granular choice of processing. As a result, the CNIL imposed a penalty of €50 million and required the decision to be published. This decision was confirmed by the Supreme Administrative Court (Conseil d'Etat) on June 19th, 2020.",
    "Related deceptive patterns": [
      "Obstruction",
      "Forced action",
      "Preselection",
      "Sneaking"
    ],
    "Related laws": [
      "GDPR - Article 04(11)",
      "GDPR - Article 06",
      "GDPR - Article 07",
      "GDPR - Article 12",
      "GDPR - Article 13"
    ],
    "title": "NGO la Quadrature du Net (LQDN) and Noyb (Complainant) v. Google LLC",
    "url": "https://www.deceptive.design/cases/ngo-la-quadrature-du-net-lqdn-and-noyb-complainant-v-google-llc"
  },
  {
    "Excerpt": "Consumer Council takes legal action against Amazon over obstructive Amazon Prime cancellation process.",
    "Our analysis": "The Consumer Council initiated legal action against Amazon, alleging unfair trading practices and violations of the Marketing Act. The case centers around Amazon's deceptive and confusing practices aimed at hindering users from canceling their Amazon Prime subscriptions.-Before the legal action, the cancellation process involved scrolling through multiple web pages filled with distracting information and vague button labels. In response to the dialogue initiated in 2021, Amazon introduced initial improvements to its Prime web interface, such as clearer cancel button labeling and shorter explanatory text. However, the Consumer Council contends that these efforts fall short of ensuring an easy and straightforward cancellation process. As a result, the Consumer Council has reported Amazon to the Norwegian Consumer Protection Authority.The Consumer Council's findings reveal several tactics used by Amazon to complicate the cancellation process, including making users confirm their cancellation repeatedly, employing design and text elements to confuse and obscure choices, and employing a strategy of intimidation and enticement by highlighting the benefits users will lose and questioning their decisions. These practices violate the users' expectations and, according to the Consumer Council, are in violation of both Norwegian and European legislation. Specifically, Amazon's actions contravene Section 6, 8, and 9 of the Marketing Control Act.",
    "Outcome": "The European Commission, along with consumer authorities from EU member states, including ACM, has reached an agreement with Amazon, ensuring that Amazon Prime users can easily cancel their subscriptions with just two clicks.",
    "Related deceptive patterns": [
      "Hard to cancel"
    ],
    "Related laws": [
      "Marketing Control Act - Section 6, 8 and 9"
    ],
    "title": "Norwegian Consumer Council complaint against Amazon Prime",
    "url": "https://www.deceptive.design/cases/norwegian-consumer-council-complaint-against-amazon-prime"
  },
  {
    "Excerpt": "The Spanish DPA fined a online genealogy platform for placing unnecessary own and third-party cookies before asking for consent, and for not offering sufficient information about cookies in the banner and in their privacy policy.",
    "Our analysis": "A Spanish consumers and users organization filed a complaint against MyHeritage, an online genealogy platform, with the Spanish DPA (AEPD), citing deficiencies in information and consent related to cookies, doubts about the processing of data for commercial purposes, deficiencies in information about processing activities, and issues with the privacy policy not clearly specifying that users should only send their own genetic material. The AEPD found that the website placed unnecessary cookies before asking for consent, and that the information provided in the banner and privacy policy was insufficient, violating GDPR Article 13 and Spanish LSSI Article 22(2).",
    "Outcome": "The AEPD imposed a fine of €16,000 (reduced from €20,000 due to early payment) on the website controller for violating Article 22(2) LSSI by placing unnecessary cookies and not providing sufficient information about them in the banner and cookies policy.",
    "Related deceptive patterns": [
      "Sneaking",
      "Forced action"
    ],
    "Related laws": [
      "GDPR - Article 13",
      "Spanish Law on Information Society Services - Article 22"
    ],
    "title": "Organization of Consumers and Users v. My Heritage, Ltd",
    "url": "https://www.deceptive.design/cases/organization-of-consumers-and-users-v-my-heritage-ltd"
  },
  {
    "Excerpt": "Planet49 ran a promotional lottery competition on its website. To play in the lottery, users were required to tick a checkbox to receive third-party advertising, otherwise they could not play. Also, the registration process included  a pre-ticked checkbox that would allow tracking of their online behaviour.",
    "Our analysis": "The Planet49 case involved the use of deceptive patterns to obtain users’ consent for the processing of their personal data. These deceptive patterns included pre-ticked checkboxes and unclear language in the consent request, which made it difficult for users to fully understand the implications of their consent. The use of pre-ticked checkboxes is a deceptive opt-out strategy that puts the burden on users to notice the checkbox and actively opt-out of the processing of their personal data. The result of this is that a reasonable user may be tricked into leaving the checkbox ticked, and inadvertently agreeing to something they did not intend. This is an example of the “sneaking” deceptive pattern.Furthermore, the unclear language used in the consent request made it difficult for users to fully understand what personal data would be processed, how it would be used, or who it would be shared with. This meant that users were not able to make informed decisions about whether to provide consent. The result of this is that a user may inadvertently provide consent to purposes they did not intend to; thereby effectively forcing users to provide consent in order to play in the lottery.The GDPR provisions that address deceptive patterns in obtaining user consent for personal data processing include Article 4(11), which defines consent as a freely given, specific, informed and unambiguous indication of the data subject’s wishes. Article 12 requires that information provided to users be concise, transparent, intelligible and easily accessible. Recital 32 of Regulation 2016/679 provides that individuals must actively agree to the processing of their data, and this should not be obscured by pre-selected options or vague or confusing language.",
    "Outcome": "The case was referred back to the German Federal Court of Justice, which subsequently upheld the CJEU’s ruling and ordered Planet49 to comply with GDPR requirements for obtaining valid consent. The company was also fined for non-compliance with GDPR requirements.",
    "Related deceptive patterns": [
      "Preselection",
      "Forced action",
      "Sneaking"
    ],
    "Related laws": [
      "GDPR - Article 04(11)",
      "GDPR - Article 12",
      "GDPR - Recital 32"
    ],
    "title": "Planet 49 vs ECJ",
    "url": "https://www.deceptive.design/cases/planet-49-vs-ecj"
  },
  {
    "Excerpt": "The Spanish DPA imposed a fine on an adult content website for violating data protection regulations. The website was penalised for using cookies without providing adequate information about their nature and purposes, as well as for having an outdated privacy policy that did not comply with the GDPR.",
    "Our analysis": "The Spanish DPA (AEPD) investigated Ramona Films S.L. (previously Kalandrakas Films S.L.), owner ofhttps://www.putalocura.com, a website featuring adult and pornographic content, for potential processing of personal data and profiling of individuals under 14. The website had a warning about the adult content and advised minors to leave the site, but the AEPD discovered that the site used Forced Action by not providing an option to reject non-essential cookies or a second layer to select specific cookies. Additionally, when accessing the site, non-essential cookies were used without prior consent, and there was hidden information about the nature and identity of the cookies. The AEPD determined that the site's cookie policy violated the Spanish Law of Information Society Services (LSSI), which requires complete information on cookie use and data processing purposes and GDPR compliance when cookies identify users. The AEPD also found that the website's privacy policy referred to outdated data protection laws, demonstrating hidden information and inadequate data protection information, violating Article 13 GDPR.",
    "Outcome": "After finding Lia's Clothes (an online clothes store) in violation of Article 22.2 of the Spanish Law of Information Society Services and Article 13 of the GDPR, the AEPD issued a fine of €10,000. However, because the controller paid the fine within the given timeframe and without objection, the fine was reduced to €8000. The AEPD also ordered the controller to revise its privacy and cookie policy to comply with GDPR regulations.",
    "Related deceptive patterns": [
      "Forced action",
      "Sneaking"
    ],
    "Related laws": [
      "GDPR - Article 13",
      "Spanish Law on Information Society Services - Article 22"
    ],
    "title": "Ramona Films S.L. Investigation by Spanish Agency for the Protection of Data",
    "url": "https://www.deceptive.design/cases/ramona-films-s-l-investigation-by-spanish-agency-for-the-protection-of-data"
  },
  {
    "Excerpt": "HH Invest SIA, an online store, was fined by the Latvian DPA (Datu valsts inspekcija) for insufficiently informing a data subject about the processing of their data.",
    "Our analysis": "During a self-initiated assessment of the HH Invest SIA website, the Latvian DPA uncovered violations related to data subject control and the provision of information required by the GDPR. Specifically, the DPA found that HH Invest SIA had not provided its privacy policy to data subjects in a systematic and comprehensible way, as required by Article 13 of the GDPR. The right to receive information related to data processing is essential for data subject control over a company's use of personal data. Without access to this information, data subjects are unable to make informed decisions about a company's actions with their data.The Data State Inspectorate, within the framework of its own initiative, assessed the content of HH Invest SIA's privacy policy and found that the information provided to data subjects was not presented in an easy-to-understand manner and was unsystematic. Some aspects of data processing, which are required to be explained to data subjects under Article 13 of the GDPR, were not adequately explained. This lack of clear and comprehensive information prevented data subjects from being fully informed about the processing of their personal data and from exercising their rights under the GDPR.Overall, the Latvian DPA found that HH Invest SIA had violated Article 13 of the GDPR by failing to provide sufficient and clear information to data subjects regarding the processing of their personal data. The use of deceptive patterns such as hidden information prevented data subjects from fully understanding and controlling the processing of their personal data, in violation of the GDPR.",
    "Outcome": "An online store was fined €15,000 by the DPA for violations related to personal data processing. However, the DPA took into account the store's active cooperation during the investigation and efforts to remedy the issues identified. The DPA acknowledged that the store had improved the information provided to data subjects as a result of the inspection. The store is one of the largest online stores in Latvia.",
    "Related deceptive patterns": [
      "Sneaking"
    ],
    "Related laws": [
      "GDPR - Article 13"
    ],
    "title": "SIA HH Invest's Investigation by Data State Inspectorate",
    "url": "https://www.deceptive.design/cases/sia-hh-invest-s-investigation-by-data-state-inspectorate"
  },
  {
    "Excerpt": "Google was held liable for deceptively tracking users' location data, even after they had disabled the \"Location History\" setting on their smartphones.",
    "Our analysis": "-The lawsuit against Google revolves around the collection of consumers' geolocation data on smartphones, even when users disabled location tracking: despite disabling the \"Location History\" setting, Google continued tracking device locations through other settings like Web & App Activity, subsequently using this data for targeted advertising.The software is pre-programmed into Android phones purchased by consumers. The company's extensive data collection practices, including user physical locations, enable them to target users in specific geographic locations, often without their knowledge or consent.",
    "Outcome": "Google has agreed to pay $85 million to settle claims made against the company under the Arizona Consumer Fraud Act and will also adjust its practices accordingly. As part of the settlement, the state sought financial compensation and mandated that Google disclose its earnings from deceptive activities in Arizona, in addition to potential civil penalties of up to $100,000 per violation.",
    "Related deceptive patterns": [
      "Obstruction",
      "Sneaking",
      "Visual interference",
      "Forced action"
    ],
    "Related laws": [
      "Arizona Consumer Fraud Act, A.R.S. § 44-1521"
    ],
    "title": "State of Arizona, ex rel. Mark Brnovich, Attorney General v. Google, LLC",
    "url": "https://www.deceptive.design/cases/state-of-arizona-ex-rel-mark-brnovich-attorney-general-v-google-llc"
  },
  {
    "Excerpt": "The Spanish Data Protection Authority (DPA) imposed a fine on a website for violating data privacy laws by installing third-party cookies without user consent and failing to provide sufficient information about the purpose of these cookies. Additionally, the website did not offer an option to reject these cookies and continued to use them without consent even after the user had deactivated the option.",
    "Our analysis": "The case reported the violation of several data protection laws by two websites of a controller. The AEPD received a complaint indicating that both websites lacked a privacy and cookies policy, or any other kind of information regarding the data that they process. The investigation conducted by the AEPD revealed that one of the websites had a privacy and cookies policy, but both websites gathered consent from the user in a generic way, with no option to specify the processing they wanted to consent to. The AEPD found that the website placed unnecessary third-party cookies on the user's device without consent. The cookie banner only provided generic information and did not have a button to reject the cookies in its first layer. An option to reject cookies was included in the banner during the proceeding. In the second layer, the user could reject unnecessary cookies. However, the authority found that, even when exercising this option, the cookies were still used.The AEPD held that the cookie banner of the website violated Article 22(2) of the Spanish Information Society Services Act (LSSI), which implements the e-Privacy Directive, as it did not properly inform the user that the website used third-party cookies with marketing purposes that would create a profile based on the user's navigation behaviour to show them advertisements related to their preferences. It also violated Article 22(2) by not allowing users to reject such cookies, using them without consent, even when the user had deactivated the option. Furthermore, during the investigation, the controller deleted the second website, which lacked a privacy and cookies policy, redirecting the user to the first website when using its domain. The AEPD also found that there had been a violation of Article 7 GDPR before the controller allowed the user to choose the specific processing they wanted to consent to. The case involved several deceptive patterns, including forced action and hidden information. The websites gathered consent from users in a generic way, without allowing them to choose specific processing. The cookie banner provided only generic information, with no button to reject the cookies in the first layer. The controller also used unnecessary third-party cookies without consent, even when the user had exercised the option to reject them.",
    "Outcome": "The AEPD has issued a set of decisions against a controller for several violations of GDPR and LSSI. The controller was warned for gathering consent in a generic way, fined €3000 for installing third-party cookies without consent, and warned for not having a privacy policy on their second website. Additionally, the controller was ordered to adapt their website's \"cookies policy,\" including necessary information in the cookie banner and preventing the use of unnecessary cookies until the user has provided consent.",
    "Related deceptive patterns": [
      "Forced action",
      "Sneaking"
    ],
    "Related laws": [
      "GDPR - Article 07",
      "GDPR - Article 13",
      "Spanish Law on Information Society Services - Article 22"
    ],
    "title": "Subdirectorate General for Data Inspection v. Flexografica Del Mediterraneo, S.L.",
    "url": "https://www.deceptive.design/cases/subdirectorate-general-for-data-inspection-v-flexografica-del-mediterraneo-s-l"
  },
  {
    "Excerpt": "Klarna Bank was fined by the Swedish DPA for insufficiently informing data subjects about its processing activities, including international data transfers, retention periods, data subject rights, and automated decision-making, such as profiling.",
    "Our analysis": "Klarna Bank AB is a multinational company that provides credit and non-credit payment solutions to over 90 million consumers and 200,000 merchants in 17 countries through various financial services, such as direct payment, \"try first and pay later\" services, payment through installments, and account information services. To provide these services, Klarna processes large amounts of personal data, including privacy-sensitive data such as financial data and creditworthiness information. The Swedish Data Protection Authority (IMY) conducted an investigation and found that Klarna violated various provisions of the General Data Protection Regulation (GDPR) related to information on purpose and legal basis for processing personal data, recipients of personal data, international data transfers, retention periods, data subject rights, and automated decision-making, including profiling. The IMY also noted a common thread among these violations, which was a failure to comply with Articles 12(1) GDPR, 5(1)(a) GDPR and 5(2) GDPR.Klarna provided incomplete and misleading information on who the recipients of different categories of personal data were when shared with Swedish and foreign credit reference agencies. This violated Article 13(1)(e) GDPR. Regarding retention periods for personal data, the IMY found that Klarna provided incomplete information about the periods for which personal data would be retained and the criteria used to determine those periods, in violation of Article 13(2)(a) GDPR. Klarna did not provide adequate information related to the right to erasure of personal data under Article 17 GDPR, restriction of processing concerning the data subject under Article 18 GDPR, the right to object under Article 20 GDPR, and the right to data portability under Article 21 GDPR, in violation of Article 13(2)(b) GDPR.",
    "Outcome": "The IMY considered Klarna's status as a multinational company handling diverse categories of personal data on a large scale, including sensitive data like financial and creditworthiness information. The breaches were found to be long-standing, prompting the IMY to impose a fine of roughly €730,000 (SEK 7,500,000) on Klarna Bank AB.",
    "Related deceptive patterns": [
      "Sneaking"
    ],
    "Related laws": [
      "GDPR - Article 05",
      "GDPR - Article 12",
      "GDPR - Article 13",
      "GDPR - Article 14"
    ],
    "title": "Swedish DPA's Investigation of Klarna Bank AB",
    "url": "https://www.deceptive.design/cases/swedish-dpa-s-investigation-of-klarna-bank-ab"
  },
  {
    "Excerpt": "TikTok was fined by the Dutch DPA for violating GDPR Article 12(1) by providing its privacy policy solely in English to Dutch users, many of whom are children under the age of 16.",
    "Our analysis": "The Dutch Data Protection Authority conducted an investigation into TikTok Inc's processing of personal data. TikTok, a California-based company, operates a mobile app that allows users to create, edit, and share short videos. A large number of Dutch children under the age of 16 use the app. During the AP's investigation, it was found that between May 25, 2018, and July 28, 2020, TikTok only provided its Privacy Policy to Dutch users, including children, in English. This was the case both during the registration process and when users wanted to access the policy while logged in. From July 29, 2020, TikTok began providing its Privacy Policy to Dutch users in Dutch. Additionally, the company provides a separate document designed for Dutch-speaking children.The AP determined that TikTok violated Article 12(1) of the GDPR between May 25, 2018, and July 28, 2020, by only providing its Privacy Policy in English to Dutch children. This article requires that data controllers take appropriate measures to provide information about the processing of personal data in a concise, transparent, and easily accessible form, using clear and plain language. This is particularly important for information aimed at children. According to the WP29's Guidelines on Transparency, TikTok must understand its target audience and ensure that the information it provides is understandable to them. The company must be aware that a significant portion of its user base consists of children under the age of 16.The AP emphasized that the requirement of intelligibility means that the controller must provide a translation of the information into the language spoken by the data subjects. This is particularly important when addressing young children to ensure that they can easily understand the information. It is irrelevant that some Dutch children may have a good command of English, as it cannot be assumed that all children in that age group will have the same level of proficiency in the language. TikTok violated the GDPR by failing to provide its Privacy Policy in Dutch to Dutch children during the relevant period amounting to language discontinuity.",
    "Outcome": "TikTok was fined €750,000 by the Dutch Data Protection Authority (AP) for violating Article 12(1) GDPR. The AP can impose a fine of up to €20 million or 4% of the total worldwide annual turnover for such infringements. The infringement was classified as category III with a penalty range of €300,000 to €750,000, with the AP increasing the basic amount of the fine by €225,000 to the maximum of the penalty range due to the gravity and duration of the breach. The breach affected a large number of data subjects, including approximately 830,000 Dutch children under the age of 18 who were less aware of the risks and their rights in relation to the processing of their personal data.",
    "Related deceptive patterns": [
      "Trick wording"
    ],
    "Related laws": [
      "GDPR - Article 12",
      "GDPR - Article 14",
      "GDPR - Article 58",
      "GDPR - Article 83",
      "Dutch Policy Rules Administrative Fines 2019"
    ],
    "title": "TikTok's Ex officio investigation by Dutch DPA",
    "url": "https://www.deceptive.design/cases/tiktok-s-ex-officio-investigation-by-dutch-dpa"
  },
  {
    "Excerpt": "MyLife.com was held liable for luring consumers in hard-to-cancel subscription programs and deceptive billing practices.",
    "Our analysis": "MyLife.com and Jeffrey Tinsley were held liable for employing deceptive tactics in their operations.-They utilized \"teaser background reports\" to lure online consumers into difficult-to-cancel subscription programs.-Misleadingly, they claimed that the company's background reports on individuals contained arrest, criminal, and sexual offender records, even when such information was absent, with the aim of persuading consumers to subscribe to auto-renewing premium services. In many cases, consumers searching for an individual's background report on the MyLife.com website were presented with search results implying, often inaccurately, that the subject may have criminal or sexual offense records that could only be accessed through a MyLife subscription. Consequently, consumers were misled into believing they or others had criminal records, including minor traffic violations.- The deceptive designs employed by MyLife included hidden costs and creating a subscription system that was intentionally hard to cancel. MyLife, operating as a consumer reporting agency, violated the Fair Credit Reporting Act (FCRA) by failing to establish reasonable procedures for report usage verification, accuracy, and lawful purposes. MyLife also was held liable for violating the Restore Online Shoppers' Confidence Act (ROSCA), and FTC Act (15 U.S.C. § 45) through deceptive billing practices and the Telemarketing Sales Rule by misrepresenting refund and cancellation policies.",
    "Outcome": "In the settlement, Tinsley and MyLife have agreed to separate judgments totaling $33.9 million, with Tinsley responsible for paying $5 million and MyLife paying a partially suspended judgment of $16 million due to financial constraints. These funds will be allocated for consumer refunds. MyLife will be obligated to pay the full remaining amount of the judgment if its financial misrepresentation is confirmed. Additionally, Tinsley and MyLife are permanently prohibited from offering products with negative option features and engaging in deceptive practices as outlined in the complaint, which includes misleading implications regarding individuals' criminal records in cases of traffic violations. Furthermore, MyLife is mandated to implement a monitoring program to ensure compliance with the Fair Credit Reporting Act (FCRA).",
    "Related deceptive patterns": [
      "Hidden Costs",
      "Hard to cancel"
    ],
    "Related laws": [
      "Fair Credit Reporting Act - 15 U.S.C. §§1681-1681"
    ],
    "title": "United States of America v. MyLife.com, Inc., and Jeffrey Tinsley",
    "url": "https://www.deceptive.design/cases/united-states-of-america-v-mylife-com-inc-and-jeffrey-tinsley"
  },
  {
    "Excerpt": "The UODO imposed a fine against a company for preventing data subjects to withdraw consent easily and effectively their consent and to request the erasure of their personal data",
    "Our analysis": "The UODO conducted an investigation into ClickQuickNow Sp. z o. o.'s processing operations compliance with GDPR in February 2019. During the investigation, it was revealed that the company did not implement appropriate technical and organizational measures that allowed data subjects to withdraw their consent and request the erasure of their personal data easily and effectively. This resulted in a violation of Articles 5(1)(a), 6(1), 7(3), 12(2), 17(1)(b) and Article 24(1) of the GDPR. Furthermore, the DPA found that the company processed the personal data of non-customers without a legal basis and without providing them with the option to remove their personal data. As a result, the company violated GDPR regulations. In addition to the fine of around €47,000, the DPA ordered ClickQuickNow Sp. z o. o. to rectify its processing practices to comply with GDPR requirements within 14 days. The company was also instructed to delete the personal data of non-customers who had requested their data to be deleted.",
    "Outcome": "ClickQuickNow Sp. z o. o., a limited liability company, has been fined approximately €47,000 by the UODO for impeding the exercise of the right to withdraw consent. In addition to the fine, the DPA has instructed the company to conform its processing practices to the GDPR's standards within 14 days and to remove the personal data of non-customers who have requested their data to be deleted.",
    "Related deceptive patterns": [
      "Hard to cancel",
      "Forced action"
    ],
    "Related laws": [
      "GDPR - Article 07",
      "GDPR - Article 12",
      "GDPR - Article 17"
    ],
    "title": "UODO's Investigation against ClickQuickNow Sp. z o. o.",
    "url": "https://www.deceptive.design/cases/uodo-s-investigation-against-clickquicknow-sp-z-o-o"
  },
  {
    "Excerpt": "We Buy Any Car Ltd, a car valuation company, was fined by the UK DPA for sending unsolicited marketing emails and SMS, with complainants unable to unsubscribe from them.",
    "Our analysis": "We Buy Any Car Ltd, a car valuation and purchasing company, was fined by the UK DPA for violating Regulation 22 of the Privacy and Electronic Communications (EC Directive) Regulations 2003 (PECR) by sending unsolicited marketing emails and SMS. The ICO investigated complaints from individuals who received these unsolicited messages and found that WBAC had sent 205.5 million email messages and 16.3 million SMS between April 2019 and April 2020. Only 14.1 million of these messages were considered solicited by the ICO, while 191.4 million were deemed to be unsolicited marketing emails. WBAC claimed that they only contacted individuals who requested a vehicle valuation or on the basis of the \"soft opt-in,\" but the ICO disagreed, stating that the messages did not meet the definition of a service message under its Direct Marketing Code of Practice.The company used hard to cancel approach by making it difficult for individuals to unsubscribe from their marketing messages. Even when individuals attempted to unsubscribe, they were unsuccessful in doing so, which is a common use in the hard to cancel technique. Additionally, the company used a nagging process by sending multiple marketing messages to individuals who had not specifically requested them, which is considered unsolicited marketing. This nagging process is a common pattern used to pressure individuals into taking action, such as purchasing a product or service. However, in this case, the nagging process was used to encourage individuals to get a vehicle valuation and to continue using WBAC's services, which violated the regulations related to direct marketing. The ICO also found that complainants were unable to unsubscribe from emails and SMS, indicating that WBAC had used deceptive patterns like the hard to cancel and nagging. WBAC was fined around €234,000, and the ICO considered this to be a serious contravention of the regulation, given the large number of messages sent over the one-year period investigated. The ICO also concluded that WBAC knew or ought reasonably to have known that there was a risk that this contravention would occur and therefore considered this contravention to be negligent.",
    "Outcome": "We Buy Any Car Ltd was fined approximately €234,000 by the UK DPA for violating Regulation 22 of PECR by sending unsolicited marketing emails and SMS, which the ICO deemed a serious contravention due to the large number of messages sent over a one-year period, and considered WBAC's actions negligent as they knew or ought reasonably to have known that there was a risk that this contravention would occur.",
    "Related deceptive patterns": [
      "Hard to cancel",
      "Nagging"
    ],
    "Related laws": [
      "GDPR - Article 04(11)",
      "Privacy and Electronic Communications (EC Directive) Regulation 2003 - Regulation 22"
    ],
    "title": "We Buy Any Car Limited Investigation by Information Commissioner’s Office",
    "url": "https://www.deceptive.design/cases/we-buy-any-car-limited-investigation-by-information-commissioner-s-office"
  },
  {
    "Excerpt": "The Belgian DPA held an organization liable for continued direct marketing practices despite objection by the complainant; and for failing to provide clear information about the right to object in the privacy policy.",
    "Our analysis": "A former donor of the organization lodged a complaint after receiving promotional materials despite objecting to the processing of his data for direct marketing purposes and requesting the organization to delete his data from its database. The dispute was taken to the litigation chamber, which concluded that the GDPR had been violated. The data controller continued to send direct marketing messages to the complainant despite being repeatedly told not to do so. Additionally, the organization did not have a legitimate basis for direct marketing, and the legitimate interests of the organization were outweighed by the rights of the complainant. The complainant had a reasonable expectation that his data would not be processed seven years after he made a donation. Furthermore, the data controller should have explicitly stated the right to object in clear and unambiguous language, as a mere mention in the privacy policy was deemed insufficient.",
    "Outcome": "Due to the organization's limited turnover and the persistence of their practices for over five years, the DPA determined that a fine of 1000 euros was appropriate.",
    "Related deceptive patterns": [
      "Hard to cancel",
      "Trick wording"
    ],
    "Related laws": [
      "GDPR - Article 06",
      "GDPR - Article 17",
      "GDPR - Article 21"
    ],
    "title": "X (the complainant) v. Y (the defendant)",
    "url": "https://www.deceptive.design/cases/x-the-complainant-v-y-the-defendant"
  }
]